{"title": "极客前端开发者劳卜精彩解读：通过微信小程序看前端利弊 ", "author": "admin", "pub_time": "2016-10-12 18:26", "content": "前言虽然内测名额十分稀少，但依赖中国广大开发者的破解和分享精神，在网络上很快出现了开发工具的破解版本和API文档。然而可能是微信的妥协或者早已预料，9月24日微信官方发布了不需要破解就可以使用的微信小程序开发者工具和文档，对于费劲心思破解完的开发者来说应该瞬间整个人都不好了。以下便是微信提供的开发工具和文档地址：https://mp.weixin.qq.com/debug/wxadoc/dev/?t=1474644087418作为一名具有极客精神的前端开发者，我也马上在这股热潮中试了下水，下载了小程序开发工具。下面是登陆后的界面：从整个结构布局来看这款IDE工具可以分为三个部分，首先左侧为导航操作区域，中间是目录或展示区域，右侧为调试区域（很像Chrome的调试工具）。下面我就以前端的角度分别从代码角度和宏观角度介绍下自己对于微信小程序的看法。代码角度纵观整个开发文档，微信小程序的前端技术主要可以分为“框架”、“组件”和“API接口”。1.框架微信提供了一套自己的用于开发小程序的前端框架，和目前主流的前端框架相比，其既有类似的地方，也有特殊的地方。特殊的地方在于其只能在微信小程序开发工具内使用，并做了相对严格的使用和配置限制，开发者必须按照其规定的用法来使用。一些外部的框架和插件在小程序里都是无法使用的，同时由于框架并非运行在浏览器中，所以 JavaScript 在 web 中一些能力都无法使用，如document，window等。而相似的地方在于其包含了和其他框架一样的“逻辑层”和“视图层”，以数据驱动为主，不操作DOM元素等。下面以代码为例子来介绍：（1）数据绑定<view> {{message}} // page.js\r\nPage({\r\n    data: {\r\n      message: 'Hello MINA!'\r\n    }\r\n})Page() 方法用来注册一个页面。接受一个 OBJECT 参数，其指定页面的初始数据、生命周期函数、事件处理函数等。这乍一看怎么和目前流行的Vue框架语法十分类似呢，Vue代码如下： {{message}} // page.js\r\nnew Vue({\r\n  data: {\r\n    message: 'Hello MINA!'\r\n  }\r\n})都是双括号插值语法，连数据初始化和双向绑定的格式都一样，好吧，就当纯属巧合吧。这里需要注意的是，微信小程序提供了WXML后缀的文件类型，其实就是类似XML的标签语言文件。（2）列表渲染 {{item}} // page.js\r\nPage({\r\n    data: {\r\n      array: [1, 2, 3, 4, 5]\r\n    }\r\n})这样的列表渲染语法相信学过Angular和Vue的同学都比较容易掌握，都是非常的类似，当然还有条件渲染等。（3）事件绑定 {{count}} Page({\r\n    data: {\r\n      count: 1\r\n    },\r\n    add: function(e) {\r\n        this.setData({\r\n            data: this.data.count + 1\r\n        })\r\n    }\r\n})如果你学过React，那么其里面有一个setState的方法可以用来改变状态的值，这里的setDate也是一样的，通过绑定的add方法来改变视图中count的值。（4）样式导入/** common.wxss **/\r\n.small-p {\r\n    padding:5px;\r\n}/** app.wxss **/@import \"common.wxss\";\r\n\r\n.middle-p {\r\n    padding:15px;\r\n}这里小程序提供了又一种新的文件后缀类型WXSS，用于描述WXML的组件样式，其与CSS文件相比还提供了像SASS和LESS这样的预编译语言的样式导入功能，同时还提供了rpx及rem的单位尺寸功能。（5）模块化// common.js\r\nfunction sayHello(name) {\r\n    console.log('Hello ' + name + '!')\r\n}\r\nmodule.exports = {\r\n    sayHello: sayHello\r\n}var common = require('common.js')\r\nPage({\r\n    helloMINA: function() {\r\n      common.sayHello('MINA')\r\n    }\r\n})微信小程序秉承了JS模块化的机制，熟悉Require.js或者Sea.js的同学应该很熟悉，这里通过module.exports暴露对象，通过require来获取对象。2.组件小程序的组件其实也是框架的一部分，主要负责UI的呈现，也自带了一些功能与微信风格的样式。基本上移动端常用的组件都包含在内，比如表单组件、导航组件、媒体组件等。下面便是小程序提供的八类组件：对于小程序的组件使用其实不是非常复杂，按照文档的使用示例便可以轻松搞定，详细地址：https://mp.weixin.qq.com/debug/wxadoc/dev/component/?t=14746440856983.API接口相比微信公众号的开发，微信小程序向开发者提供了更多的API接口，可以方便的调起微信提供的能力，比如监听重力感应和罗盘数据、WebSocket连接、支付功能等。下面以一个发起网络请求的API为例：wx.request({\r\n    url: 'test.php',\r\n    data: {\r\n        name: 'luozh' ,\r\n        age: 18\r\n    },\r\n    header: {\r\n        'Content-Type': 'application/json'\r\n    },\r\n    success: function(res) {\r\n        console.log(\"请求成功\")\r\n    },\r\n    fail: function() {\r\n        console.log(\"请求失败\")\r\n    }\r\n})wx.request发起的是https请求。一个微信小程序，同时只能有5个网络请求连接。关于更多API接口的介绍请查阅官方文档。以上便是关于微信小程序前端代码部分的简单介绍，相信有一点前端框架使用经验的同学上手都是相对容易的，下面将从宏观角度讲解下我个人认为微信小程序给前端领域的带来影响。宏观角度微信小程序一出来的时候，网上关于其对于前端界的影响层出不穷，更多的文章和评论认为前端又要火了，前端的第二春来了，Javascript和HTML5的新时代来了等。当然微信小程序的出现确实会给前端带来一定的推波助澜的效果，但是任何一件事物的诞生都是利弊并存的，微信小程序也不例外。以下便简单阐述下我个人的看法：1.利（1）提高开发兼容性：微信小程序可以说是重新定义了APP，使得一款应用能够在android、iphone及windows phone中都能运行，对于前端来说实现了“一次编译，到处运行”的理念。（2）推动前端技术的发展：微信小程序以其简单的开发环境，使以Javascript和HTML5为主的前端技术在庞大的微信社交群体内传播，越来越多的人开始接触前端，参与到前端编码和设计中来，为前端技术贡献力量。（3）其他...2.弊（1）增加前端工作量及学习成本：原本一名前端工程师负责的平台就很广泛，包括PC端、移动端、APP应用等，微信小程序的出现会要求前端涉及微信应用的开发，一定程度增加了学习和工作成本。同时企业也会增加这方面的开发和投入成本。（2）前端竞争日趋明显：微信小程序的诞生可能又会吸引一批后台、APP开发等其他领域的人员转向前端开发，而这些本来就具备较强逻辑思维或者较强感性思维的人将挤掉那些处于前端边缘的新手，可能使得大部分低水平前端开发者面临失业或者找不到工作的危险。（3）其他...这里大概介绍了几点微信小程序给前端带来的影响，更多的大家可以补充。总结本文从代码角度和宏观角度简单阐述了微信小程序在前端领域的一些内容和影响，希望能够帮助那些不了解微信小程序的开发者很快入门并认识这一新的技术领域。至于小程序对于前端的影响，反过来我们也可以这样认为：技术的发展不是基于一个平台去改变，而是通过技术去驱动一个平台改变，正是因为前端的发展才催生了“小程序”的这种可能性…"}
{"title": "“小年糕+”称霸小程序排行榜，它凭什么和拼多多竞争？ ", "author": "Rolan", "pub_time": "2019-12-3 00:14", "content": "一个银发人群工具小程序，何以长期占据小程序TOP榜单前五？  这个名为“小年糕+”的小程序，有着怎样的产品和运营套路？阿拉丁指数每个月都会发布一期微信小程序TOP榜单，翻看每个月的榜单，前几名有几个产品总是稳定霸榜。其中，拼多多、京东购物、同程艺龙等都是大家耳熟能详的小程序。但是其中有一个小程序，叫“小年糕+”，也非常稳定地持续霸榜前五，偶尔甚至升至第一。这是一款怎么样的小程序？用户都是哪些人？为什么可以持续霸榜？在我不断的深入研究后，发现了他们的数据不得了，用户总数超过5亿，日活超千万；更令人匪夷所思的是，几乎所有用户都是中老年人。一、“小年糕+”是啥？小年糕，是一个可分享短视频、制作影集小视频的小程序。不知道大家有没有收到过来自爸妈、老舅、二姑等亲戚的视频？其实多数都是来自于小年糕。没错，小年糕就是这样一款面向中老年群体的银发经济产物，是一款工具型小程序。小程序内有非常多可供中老年人传播的短视频，可以非常简单地转发给微信好友。另外通过简单的几个步骤，上传几张图片、根据提示点几下就可以生成自己的短视频（影集）并上传到平台或转发给好友。这两个功能也是小年糕提供的最主要的功能。小年糕成立于2014年，最初成立的目的就是方便中老年人能够简单、方便地制作视频。经过多年发展，目前小年糕已经形成了“微信服务号+订阅号+小程序”的生态矩阵，用户总数超5亿，日活超千万。大家可以看一下他们的内容，几乎篇篇十万+，热门视频留言成千上万。这样一款面向中老年用户的工具型产品，是如何在同质化产品严重的今天，突出重围，甚至在与拼多多、京东购物等互联网巨头产品的排名比拼中不落下风的呢？我试用了一周的产品，分享一些自己的见解。二、为什么是小年糕1. 满足中老年人的社交需求小年糕说白了其实就是一款简单的电子相册制作工具，为何可以吸引如此多的中老年用户，且持续保持高用户黏度？我们先来看一个场景。某个周三的上午10点，退休的张阿姨已经买菜归来，儿子在杭州上班，老伴出门下棋。闲着无事可做，忽然想起了周末出门旅游的照片，于是翻看了起来，想分享给一起跳广场舞的姐妹们。但是单独发照片似乎太单调，于是打开了小年糕。一键上传，自动配乐，自动生成，不一会一段小视频就生成好了。张阿姨一键转发到广场舞群和朋友圈，不到半小时，就收获了30多个赞。群里的李阿姨点开视频，羡慕不已，想着自己如果也可以做一个多好，于是点了下方的“制作影集”。没想到流程非常简单，没几分钟就做好了自己的小视频，然后转发了出去。这就是一个典型的小年糕用户使用场景及传播路径。小年糕之所以可以在银发市场霸榜，最主要的原因就是它切中了中老年用户的社交需求。没错，我在上面一直称小年糕是一款工具型产品，这是相对片面的。在我看来，小年糕已经完全脱离了工具型产品的定位，而是一款针对中老年市场的辅助型社交产品。多数中老年人辛苦半生，闲暇时间越来越多，而随着微信的普及，中老年人的社交阵地也从街头巷尾、小区广场延伸到了微信内。他们对于社交的需求越来越大，渴望表达与被理解，而对比图片与文字，视频成了表达最好的媒介。小年糕正是抓住了用户的社交需求，无论你想表达何种情绪，你都可以在小年糕找到适合的视频。你可以通过简单的步骤生成自己的个人影集视频，通过视频的传播，表达自己的情绪。2. 免费使用小年糕是免费使用的，对于银发市场而言，这不是算是优势，这是必须；收费产品将会劝退大多数中老年用户。3. 界面简单，操作简易小年糕小程序的界面非常简单，中老年人容易上手，学习成本低。所有的字体均经过放大处理，容易阅读，按钮清晰而且大，不易误触。一切的设计都是从中老年人的使用习惯出发，对缺乏电子产品使用经验的中老年人非常友好，降低了使用门槛；避免了因为界面复杂、操作繁琐而造成的用户流失。例如上图，小年糕制作影集非常简单。首页有非常明显的重点提示（玫红色底+白字），然后引导用户上传照片或者视频，分为简单版与复杂版。复杂版需要用户自己设置音效，选择模板等。而简单版则直接为用户自动选择模板与音乐，直接生成影集。影集生成后，还会发消息提示给你。4. 优化用户路径，提前感知产品价值对于中老年用户来说，使用小年糕小程序最重要的就是观看视频及制作影集。因此小年糕的页面设计是花了心思的，用户进入小程序，视觉重心自然地放在了首页的热门视频及下方的加红加粗制作影集上了。通过设计，优化用户使用路径，将核心功能优先展示，让用户立刻体验到AHA时刻。用户通过视频或影集的制作与分享，满足了社交分享的需求，感知到产品的价值，也就容易被激活与留存。产品同质化严重的现在，任何优势的不断积累，都会慢慢的拉大与竞品的差距。红色区域为视觉重心，指向视频观看与制作影集两大核心操作。5. 留存难题定位为“用完即走”，自带工具属性的小程序，用户留存一直是所有运营人员最大的难题。那么小年糕是如何解决这个难题的呢？在体验几天之后，我有了一些自己的想法。1）形成矩阵，相互导流小年糕建立了微信服务号、订阅号、小程序的矩阵生态，且各个模块保持了内容的一致性，相同打通。用小程序利于分享的特点，进行传播引流，然后沉淀到公众号内。利用公众号私域的特点，定期利用优质内容对用户进行唤醒，并养成用户习惯。2）占据入口，把握主动用户进入小程序的入口，总结起来只有这么几个：扫码进入、通过公众号进入、通过对话框中的小程序进入、搜索进入、通过收藏的小程序进入。结合用户环境及用户画像，扫码、搜索、收藏等进入方式显然并不合适，中老年人不同于年轻人，对于微信的使用并不是特别熟练，因此入口需要越简单越好，越明显越好。小年糕通过持续稳定的推送高质量内容，引发用户传播，从而占据了公众号入口和对话框入口。通过占据入口，把握了活跃与留存的主动权。而且这里有个功能，给我的体验特别好。生成影集是需要时间的，如果用户照片多的话，时间更久。那么如果中途用户离开，之后忘记制作影集这回事儿，或者找不到入口了，就会造成流失。在影集制作完成后，会给用户发一则消息，提醒用户制作完成，并提供入口。3）UGC内容生态相比于竞品，小年糕有着强势的内容生态优势。我通过体验观察发现，平台内的优质内容非常多（高观看、高评论、高转发），而且其中非常大多是用户生成的。内容下面的热门评论，经常获得上千赞。试想一下，这些赞会带给中老年人多大的满足感，是对他们的认可。转发、评论、点赞等数据带来的社交光环与满足感，在中老年人的生活中更容易放大。这些年轻人看起来比较虚的东西，对于中老年人来说却是非常重要，对UGC的内容创作也是非常大的激励。说到这里，小年糕对于自己核心用户的需求的把握，是非常精准与重视的。当你在一款产品能够持续获得激励，获得满足感，满足社交需求。那你的黏性、你的转移成本就会非常高。其他竞品如何去撬动用户？去抹平用户转移成本？产品也就慢慢形成了自身的壁垒。三、总结小年糕的成功，我们有哪些可以借鉴的地方。1. 选定目标市场产品需要从目标用户画像出发，找到适合的运营方向。比如，针对银发市场的中老年人，如何围绕他们去制定、优化现有的产品运营方法。在产品端，如何去优化设计，让用户的使用流程简单、操作便捷，降低用户的使用门槛（下载、注册、登录等流程，能省就省，能砍就砍）。如何通过路径优化，去提升用户对产品价值的感知，并形成黏性。2. 洞察用户需求如何通过洞察用户需求，并围绕满足用户需求去做一整套的运营动作，通过这些运营动作去达成我们的目标。用户的需求是社交，那就通过方便的转发、评论、点赞等功能，来提升产品的社交属性，满足用户的社交心理。就像用户想要一匹更快的马，实际上的需求是更快的到达目的地，福特洞察了用户真正的需求从而发明了汽车。而小年糕的用户的需求看起来是为了制作影集，但实际上是为了通过影集来实现社交需求。那么在运营工作中，就应该针对社交这一属性进行重点运营。了解用户，了解用户需求，已经不单单是产品经理的职责。优秀的运营，早已经把用户需求整合到自己的运营套路中了。#专栏作家#T哥；微信：T2018skr；公众号：用户运营玩起来（ID：happy_yiyi517），人人都是产品经理专栏作家。5年运营从业经验，从事过社群运营、活动运营、用户运营等多板块，希望用简单的文字讲述复杂的内容。本文原创发布于人人都是产品经理。未经许可，禁止转载题图来自Unsplash，基于CC0协议"}
{"title": "给小程序挑选物美价廉的正版音乐，用它 ", "author": "Rolan", "pub_time": "2019-12-5 00:01", "content": "每一个由开发者辛辛苦苦码出来的小程序，都值得拥有配得上它的背景音乐。这是理想状态。现实情况是，当你选好了一首“意中音乐”，它却可能会害你收到来自法务的问候：“您使用的音乐已侵权”。当你决定为了心爱的小程序把这首音乐买下来，还可能会遇上音乐版权价格不合理等bug。找一首音乐，比写代码还难？No！还好你点进了这条推送，正式为你介绍，由腾讯云提供的“正版曲库直通车”能力，物美价廉第一名。 1“曲多多”与“曲快快” 正版曲库直通车能力基于腾讯音乐娱乐集团旗下爱听卓乐线上背景音乐专用曲库。翻译一下，这也就意味着大量专用背景音乐版权素材。 其次，正版曲库直通车基于腾讯云存储、内容加速网络等基础能力，提供标准接入方案，让开发者通过标准接口调取已有版权的音乐素材，并完成存储加速等基础分发功能。翻译一下，这也就意味着快如闪电的内容加速能力。 2这些类型小程序要高度注意 小程序开发者们正在基于更多场景进行玩法创新，正版曲库直通车让玩法变得更加简单。以下类型的小程序开发者们，可以重点关注一下：  图片相册美化类——可应用于影集相册背景音乐、素材/滤镜背景音乐  视频拍摄编辑类——可应用于视频剪辑背景音乐、素材/滤镜背景音乐  UGC内容创作平台类——可应用于信息流背景音乐、文字内容背景音乐、短视频背景音乐  电商类——可应用于商家店铺背景音乐、商品宣传视频背景音乐、个人评价视频背景音乐  工具类——可应用于工具类小程序背景音乐不属于以上类型的小程序开发者，也可以将自己的小程序与音乐结合，实现更多场景创新。 3想接入，看这里要接入正版曲库直通车，需要几个步骤？首先，你得在腾讯云官网注册成为腾讯云用户，获得一个腾讯云ID。其次，填写你选中的曲目，并介绍具体的曲目使用场景，并提交后台审核。审核完成后，服务即可开通。随后，你就可以进行域名接入配置了。根据你的开发需求，正版曲库直通车提供包括包年包月等多种灵活的付费模式。正版曲库直通车（点击乘坐）手把手详细指引（点击了解）祝大家都能遇到热爱的音乐，做出理想的小程序。"}
{"title": "微信小程序-可移动菜单 ", "author": "Rolan", "pub_time": "2019-12-5 00:18", "content": "我们可以经常看到手机app里有的菜单栏是悬浮在首页的，用户可以拖动和点击菜单栏进行交互，今天代码君就教大家利用小程序的控件，实现一个可移动的菜单，效果图是这样的，要实现这样的效果，需要引出我们今天的重要人物movable-view movable-view属性介绍实现可移动菜单一、wxml界面的实现<view class='title-line'>  movable</view><movable-area class=\"moveArea\">  <movable-view class='moveView' x=\"{{x}}\" y=\"{{y}}\" damping=\"40\" direction=\"all\" inertia='true'>菜单  </movable-view></movable-area><button class='button' type='primary' size='mini' bindtap='moveView'>点我随机滚动小方块</button><button class='button' type='primary' size='mini' bindtap='stopMove'>点我停止随机滚动</button>界面布局比较简单，需要注意的几点1、movable-view 必须设置width和height属性，不设置默认为10px 2、movable-view 默认为绝对定位，top和left属性为0px 3、当movable-view小于movable-area时，movable-view的移动范围是在movable-area内；当movable-view大于movable-area时，movable-view的移动范围必须包含movable-area（x轴方向和y轴方向分开考虑） 4、movable-view必须在组件中，并且必须是直接子节点，否则不能移动二、xxx.js随机移动实现的逻辑Page({  data: {    x: 0,    y: 0,    isStop:false,},  moveView:function(e)  {    var that = this;    setTimeout(function () {      that.move(that);    }, 1000);  },  stopMove: function (e) {    this.setData({      isStop: true    })  },move: function (that)  {    var randowX = that.GetRandomNum(1, 200);    var randowY = that.GetRandomNum(1, 400);    that.setData({      x: randowX,      y:randowY,    })    if(!that.data.isStop)    {      setTimeout(function () {        that.move(that);      }, 100);    }  },  //随机函数  GetRandomNum: function (Min, Max) {    var Range = Max - Min;    var Rand = Math.random();    return (Min + Math.round(Rand * Range));  },js里面需要讲解的内容比较多1、x/y 用来控制菜单栏的位置，isStop停止移动 2、介绍一个js延迟执行事件的方法setTimeout（function () { }, 1000)，逗号左边执行事件的方法，右边设置延迟多久执行事件，1000对应的是一秒 3、GetRandomNum 这个方法是我自定义的，用于生成随机数字，计算滚动的距离 4、还有一个需要注意点是，要事件监听更新数据的时候，this对象在程序中随时会改变，此时需要执行 var that = this;把this对象传递给that就可以解决上面遇见的问题三、wxss样式.moveArea {  height: 400px;  width:200px;  background: red;  margin: 10px;}.moveView {  height: 100rpx;  width: 100rpx;  line-height: 100rpx;  background: blue;  border-radius: 50%;  text-align: center;  margin: 10rpx;}今天讲解的样式有一下几个如何把图形从方形变成圆形？border-radius 这是今天的主角，把他的值设置成50%，就由方形变成圆形了，这个属性是设置圆角的，设置10%，是有一点圆角的方形 设置内容垂直居中方法这是代码君的一个小窍门，把height和line-height设置成一样，他自动会垂直居中 总结 今天讲解的是可移动的菜单，本身实现是没什么难度的，我又引入了几个知识点，一个是推迟事件函数的使用还有就是几个css样式设置的小窍门，读者回去认真记住使用规则，后面我们陆续会用上，好啦，今天的课程就到这~"}
{"title": "小程序开发指南之性能优化 ", "author": "Rolan", "pub_time": "2019-12-5 00:24", "content": "作者：HerryLo将从代码层面和项目层面，聊一聊微信小程序的性能优化问题，希望有所帮助。也是自己最近的一个总结。(前置知识：微信小程序的视图层是WebView支持，逻辑层是JSCore支持，逻辑层通过setData与视图层发生交互。每一个页面都是一个WebView页面）详见：小程序的运行环境下面的内容不论是使用Taro框架开发，还是微信小程序原生开发，都是适用的。代码层面拆分组件图片压缩减少不必要数据避免频繁setData使用webView组件开发项目层面拆分小程序分包预加载尽量升级版本库#代码层面通过代码细节提升性能，而且在这方面，空间是非常大的。对于比较早期的小程序项目，由于代码细节方面没有过多的考虑，也导致了开发出的小程序非常的消耗性能。下面将提到的一些点，不论是正在开发的项目，还是在维护的项目，都会有一定的帮助。· 拆分组件对于小程序的项目，由于野蛮式开发，不会太多的考虑组件拆分。当然对于关注组件开发的公司，肯定会在早期就做好一定的规划。做好组件的拆分，可以保证组件的复用，大量的减少重复的代码。（组件开发的思想，目前基本适用所有的前端开发项目）。如何有效拆分组件方法，详见[译] 你是如何拆分组件的？· 图片压缩在微信小程序项目中，不会在本地存放图片，基本都是网络图片，而网络图片的下载，需要消耗一定的时间和内存。较小图片的大小，可以提升小程序的渲染时间，减少内存的占用。通过CDN静态资源服务器获取图片资源，添加图片压缩规则，可以极大的提升性能。· 减少不必要数据减少data中的亢余数据。不必要数据，传入setData会造成不必要的性能消耗。建议：不要直接将接口数据全部保存在data中，只有页面需要渲染的 数据，才通过setData进行挂载，非必要的数据可以直接挂载在当前页面page的this上。let data = {\r\n    list: [item, item, item, item, item],\r\n    title: \"xxxx\",\r\n    path: 'xx/xx/xx'\r\n}\r\n复制代码// 不好的处理\r\nthis.setData({\r\n    data: data\r\n})\r\n\r\n// 好的处理 只挂载必要参数\r\nthis.setData({\r\n    dataList: data.list\r\n})\r\nthis.title = data.title\r\nthis.path = data.path\r\n复制代码· 避免频繁setData// 不好的处理\r\nthis.setData({\r\n    count: 1\r\n})\r\nthis.setData({\r\n    count: 2\r\n})\r\nthis.setData({\r\n    count: 3\r\n})\r\n复制代码三次setData会被全部触发嘛？是的，会被全部调用。在微信小程序中，并不像react，把多次操作合并。每次setData的过程，就是一次JSCore逻辑层 和 webView视图层的交互。过多的交互，会降低小程序的用户体验。例如 滑动监听滚动，操作setData，非常的消耗性能，可以考虑使用节流函数，降低调用频率。官方给出的说法是：setData接口的调用涉及逻辑层与渲染层间的线程通信，通信过于频繁可能导致处理队列阻塞，界面渲染不及时而导致卡顿，应避免无用的频繁调用。来修改一下上面的代码。// 好的处理\r\nlet data = { count: 1 }\r\ndata.count = 2;\r\ndata.count = 3;\r\nthis.setData(data)\r\n复制代码· webView组件开发灵活性非常强的页面，同时需要多端使用，建议使用微信小程序提供的webView组件，套用h5页面进行页面开发，避免重复开发。当微信小程序包过大之后，也建议使用h5页面替换开发。详见webView 组件<web-view src=\"{{link}}\" bindmessage=\"bindMes\" bindload=\"bindLoad\"/>\r\n复制代码#项目层面通过微信小程序项目配置来提升加载性能，下面的方案可以有效的解决问题，不过也要试情况而定。· 拆分小程序在包过大的情况下下，可以进行小程序包的拆分，详见：分包加载。对小程序进行分包，可以优化小程序首次启动的下载时间，以及在多团队共同开发时可以更好的解耦协作。如果业务庞大，也可以单独抽离一个新的小程序。· 分包预加载采用分包配置之后，分包加载也是需要时间的。对于一些比较常用，或者比较重要的页面，可以采取分包预加载的手段，来完成分包的提前下载，减小分包载入的时间。详见 分包预下载· 尽量升级版本库注意基础版本库的问题，在合适的前提下升级版本库，尽量将版本库升级为最新版本。因为版本库升级为最新，可以有效避免很多问题。吐槽：目前随着各大公司业务的不断迭代，小程序的体积不断真大，小程序渐渐的不在小。希望尽量的让小程序小起来，发挥它小的作用。希望以上内容可以帮到你。更多内容：'小程序个人开发指南ps: 微信公众号：Yopai，有兴趣的可以关注，每周不定期更新，分享可以增加世界的快乐"}
{"title": "微视放大招“勾引”商家：支持打开微信小程序 ", "author": "Rolan", "pub_time": "2019-12-10 00:01", "content": "声明：本文来自于微信公众号晓程序观察（ID：yinghoo-tech），作者：Miss豆教授，授权站长之家转载发布。微视能打开微信小程序了!这可不是信口胡说，有视频为证：如图所示，用户点击商品，即可直接跳转至「每日优鲜」微信小程序，选购、下单。据晓程序观察(yinghoo-tech)了解，目前该能力仅针对特定的两个小程序电商平台合作方开放— 京东联盟和魔筷星选 。具体是怎么回事?这对小程序开发者们有怎样的好处?这背后还有什么更深远的意义?1微视+微信小程序的闭环长什么样?在讨论影响和意义之前，必须先弄清楚产品逻辑。微视和微信小程序的本次联动，逻辑很简单，从使用体验可以看出，达人可以在微视上选择插进商品，商品来源于小程序。值得注意的是，所有商品均来源于京东联盟和魔筷星选：京东联盟是京东旗下的电商广告联盟平台，其业务模式主要是CPS业务，以成交订单支付佣金。商家可以将自己品牌、商铺在京东商城的产品，分发到京东联盟，而微视达人可以选择京东联盟上的产品，插进自己的微视商品页，用户点击，就可以进入京东旗下小程序进行下单购买。魔筷星选则是快手战略投资的企业，定位是“专为网红定制的手机开店助手”。从前文的视频可以看到，跳转的「每日优鲜」小程序实际上是在「无敌掌柜」小程序电商平台上开的一个店铺，「无敌掌柜」正是魔筷星选旗下产品。两者的思路都一样，网红、达人，在自己的微视主页上展示商品，如若用户通过该入口进入小程序下单后，他们可以获得相应的佣金。佣金比例商家可以在京东联盟、魔筷星选的后台进行设置。比较有意思的是， 用户从微视跳转到小程序后，小程序页面上有一个按钮，可以一键返回微视。 如此，微视和微信小程序可以形成完整的服务闭环：用户看内容→跳转小程序购买→回头微视看其他内容。2微视的思路“棒!期待全量开放啊!”在得知这一能力后，不少开发者喜形于色，他们呼吁微视支持向所有微信小程序全量开放支持插进挂载。和他们一样期待的，还有达人。说到底就是因为，这个场景跳转闭环中，开发者的微信小程序多了一个微信场景外的流量入口——微视，事实上，微视是除了线下、线上扫码之外，唯一一个微信外小程序流量入口。“也是最值得看好的一个入口。”一位开发者对晓程序观察(yinghoo-tech)表示。他的兴奋皆源于对短视频的看好，因为短视频作为一种内容介质已经是公认高价值。而达人在推广内容的过程可以推广产品并获得佣金，多了一条赚钱的路，何乐而不为。事实上，此前微视为达人设置了商品开通权限， 为达人探寻更多变现可能是所有短视频平台必修的课题。事实上，微视此举也说明了其接下来的思路。众所周知，微视是腾讯在短视频领域最力捧的产品，但和抖音、快手两位短视频“老大哥”有很大差距，如何生成更多内容、吸引更多流量一直是微视的命题，甚至曾为此“请出”微信朋友圈帮忙：今年年中，微信联合微视推出新功能，用户可以通过微视发布 30 秒视频至朋友圈，具体的显示并不是链接形式，而是单独的视频。此前，微信朋友圈只能发送 10 秒短视频，此举无疑会造成一些用户在 30 秒时长的刺激下开始使用微视。为此，微视还为此功能特别上线了多款照片与视频模板。但纯刺激C端用户生产内容的路，是远远不够的。“一个优质的短视频，需要脚本创意、视频拍摄、剪辑，普通用户很少有人具备这样的能力。”一位开发者对我们表示。因此，微视的新思路是， 用商业化来打开更多B端机构、品牌、商家入局。 企业的大量入驻无疑会扩大优质内容生产。 目前，抖音蓝V企业号早已破 500 万，企业对抖音的热情无非是两个原因：流量曝光和变现。关于变现，无论是抖音还是快手，都在迅速探路：据晓程序观察(yinghoo-tech)了解，目前抖音安卓端商品插入支持淘宝、京东、考拉、苏宁、抖音小店和抖音自己的内测小程序，除了抖音内测小程序，其他平台的商品载体均为H5。这样的玩法带来的想象力让无数开发者心驰神往。“在抖音搜索电影名称，可以直接跳到小程序购买，或者看电影的预告片直接进入小程序购买。”一位开发者说。(抖音搜索电影名称，直接跳转小程序)(看电影预告片直接进入小程序购买)另一边的快手，今年上半年年为每个主播的个人主页将新增“快手小店”，每个主播均可开启自己的小店，在快手作品、短视频、直播等场景内，引导粉丝点击进入商品页，商品全部来源于有赞商家店铺。“短视频的价值已经得到了无数验证，这个大潮是绝对无需质疑的，你看，QQ阅读都上线了抖音小程序，用户看到一个预售的预告片，点击小程序购买，路径多么完美。”上述开发者感慨。在他们看来，腾讯在短视频的失策“简直是不可原谅的”，既然腾讯不放弃微视，砸重金支持微视的同时，应该考虑与微信小程序更高的配合。“在服务领域，小程序已经包罗万象，短视频+小程序简直所向披靡。”上述开发者认为，微视就是应该打通微信小程序，形成腾讯集团军短视频商业生态。这个美好的遐想，可能微视也很渴望，能不能实现，还得看对用户体验有着极致“精神洁癖”的微信怎么想。"}
{"title": "填坑：微信小程序用canvas海报踩到的坑 ", "author": "Rolan", "pub_time": "2019-12-11 00:02", "content": "周末在小程序上做了个给头像戴圣诞帽的功能，先调用用户头像，再用canvas绘制新头像，在绘制新头像时遇到两个问题。一、开发者工具报错： https://wx.qlogo.cn 不在以下 downloadFile 合法域名列表中……调用本地图片和拍照都没有报错，然而调用用户头像就报错了，这是因为用户头像是网络图片。要解决这个问题，在小程序后台加合法域名就可以：二、canvas图片在真机上看不到用户头像解决了第一个问题，在开发者工具可以正确生成新头像，后来真机打开才发现是空白的。原因：小程序的canvas绘制图片，图片路径必须为本地的路径，不能是网络路径。解决方案：获取到头像后，用downloadFile方法把网络图片下载到本地，下载之后再开始绘制canvas。wx.downloadFile({\r\n    url: this.avatarUrl,\r\n    success: function (res) {\r\n        that.setData({\r\n            avatarUrl:res.tempFilePath,\r\n        })\r\n        that.draw(); // 绘制\r\n    },\r\n    fail: function (err) {\r\n        console.log(err)\r\n    }"}
{"title": "小程序加急审核流程上线 ", "author": "Rolan", "pub_time": "2019-11-4 00:13", "content": "为优化小程序审核体验，配合各位开发者解决小程序的紧急迭代需求。平台上线了加急审核流程，开发者可根据自身业务情况进行审核加速申请。1.加急申请入口符合条件用户在审核提交页面即可见【加急】，选择【加急】并填写【“加急类型”“ 加急说明”】情况后提交审核。2.加急次数说明                （1）非个人主体类型：每个自然年有3次申请加急机会（2）个人主体类型：每个自然年有1次申请加急机会注：①提审勾选加急后，如在审核前撤回，机会不被消耗；如加急审核单已被审核，无论审核结果通过/不通过，加急机会都将被消耗。请开发者谨慎合理使用加急机会；     ②如勾选加急后，审核单被驳回。开发者在12小时内再次提交审核或者通过驳回站内信内的【前往反馈页面】提交反馈，可获得相对加急的审核队列。3.加急审核时间段与审核时长（1）非个人主体类型：9:00-24:00（2）个人主体类型：9:00-21:00审核时长：正常加急审核预计2小时内完成。请开发者结合审核工作时间及加急单等待时长综合评估提审加急单的时间。如需当天加急审核完成，建议非个人主体在22:00前，个人主体在19:00前提交加急单。注意：如遇节假日如春节假期前等加急提审队列拥挤，或小程序代码包含复杂逻辑等特殊情况，将无法保证加急审核在2小时内完成。4. 以下情形的代码提审单暂不支持加急审核选择国内主体的以下类目或选择海外主体后首次提交代码审核，需报属地网信部门复核，预计审核时长7天左右，暂不支持加急审核。加急审核机会是根据平台审核资源调配，配合开发者遇重大提审节点快速审核迭代的体验优化。每个小程序的加急额度是有限的，请提交前自行检查，确保加速版本的小程序符合法律法规和平台规则，避免浪费有效加急机会。同时，开发者也可以通过小程序评测达标来获取更多的加急机会。加急审核机制上线后，我们会根据开发者的使用额度情况及审核资源情况等，对目前加速审核机制进行动态调整与优化。"}
{"title": "解密国内BAT等大厂前端技术体系-腾讯篇（长文建议收藏） ", "author": "Rolan", "pub_time": "2019-11-5 00:02", "content": "为了了解当前前端的发展趋势，让我们从国内各大互联网大厂开始，了解他们的最新动态和未来规划。这是解密大厂前端技术体系的第三篇，前两篇已经讲述了阿里和百度在前端技术这几年的技术发展。这一篇从腾讯讲起。2 腾讯团队介绍2018年9月30日，腾讯宣布正式启动新一轮战略升级，优化组织架构，将原有的七大事业群拆分重组，在保留原有四个事业群的基础上新增 平台与内容事业群 和 云与智慧产业群 。平台与内容事业群（PCG）成立后，把过去散落在QQ、QQ浏览器等不同产品中的团队聚集到一起。腾讯是希望，5G时代到来的时候，它们在内容流方面成为国内的重要媒体。全新的平台与内容事业群（PCG）成立，腾讯业务最多、规模最大的部门诞生了。涵盖新闻、长短视频、影业、动漫、信息流、社交平台各级管理干部和产品业务，来自于原先四个不同的事业群，员工数量超过一万人。云与智慧产业事业群（CSIG）的主要部分，脱胎于原SNG旗下的腾讯云业务，也包括原SNG的音视频团队、优图AI实验室团队，另外还并入了原CDG的智慧零售、原MIG的地图、安全、孵化器的互联网+业务。这是腾讯成立20年历史上，第一次出现完全TO B的大业务单元。腾讯把TO B业务提升到了一个前所未有的战略高度。原本分散在各个事业群下面的TO B业务，获得了一个统一的接口，将以更加聚合、更加高效的方式为企业客户提供服务。介绍完腾讯的组织架构后，下面重点介绍一下腾讯前端的技术团队情况：AlloyTeam腾讯 Web 前端团队 - Alloy Team 来自于腾讯 SNG(社交网络事业群)，源于 2008 年成立的腾讯 WebQQ 团队，于 2011 年 10.24 正式对公司外以< 腾讯 AlloyTeam> 为团队名称进行对外交流，AlloyTeam 的寓意是：像合金一样将各种技术，以及各个成员的聪明才智聚合在一起，从而产生更强的合金特性，未来我们也希望通过聚合业界的各大前端牛人，来共同推动 Web 前端技术在中国的发展！我们致力于 Web 前端技术的研究，热衷 HTML5、移动 Web 技术，用最酷的新技术开发各种有趣的开源项目。Alloy Team在业界具有非常高的知名度，在开源社区也是非常活跃，一些热门的项目有： wepy- 小程序组件化框架， omi - 前端跨平台框架， weui - 微信风格UI组件库等等。IVWebIVWEB团队是腾讯专业的前端团队，我们的口号是“卓越Web，全栈研发”。主要负责腾讯移动直播产品NOW直播 、花样直播、花样交友、手Q附近等腾讯直播平台研发工作。团队注重社区建设和对外交流分享，目前对外开源项目有： Feflow 和 Aegis 。除了开源项目以外，IVWEB团队还组织了TLC腾讯Live开发者大会，目前已经是第三年了，会议内容涵盖跨平台、小程序开发实践、服务端Node/Serverless、监控等等主题，在业内已经颇具影响力。CDC腾讯CDC，全称“腾讯用户研究与体验设计部（Customer Research & User Experience Design Center）”，2003年开始组建，正式成立于2006年5月，是腾讯公司级的设计团队，分布深圳、北京、成都三地，致力于提升腾讯产品的用户体验，探索互联网生态体验创新。CDC经历过腾讯重大产品的体验设计，如QQ、QQ空间、QQ游戏、RTX 、QQ电脑管家、QQ浏览器、QQ音乐、腾讯视频、开放平台、企业QQ、腾讯网、财付通、腾讯微博、朋友网、腾讯地图、QQ拼音、SOSO、拍拍、腾讯WE大会、微众银行、米大师、企业云、安全云、AI LAB、微保、腾讯公益、数字广东等，以及更多概念产品的孵化。TGideasTGideas隶属于腾讯互动娱乐旗下，专注IP内容力构建与发展，是集产品内容开发，内容营销，IP商业化拓展，体验设计等能力为一体的中台设计团队。成员由资深创意人，内容创作者，视觉设计师，概念艺术家，技术工程师，内容营销策划，内容商务等成员组成。这个团队在创意设计方面有非常深厚的功力，有不少关于图像、影视方面的创作。同时在技术方面，他们也开源了例如适用于移动端的Motion组件库、移动端Mocha-UI组件库、字体压缩Font Spide等等。下图是腾讯前端技术体系的 全景图 ，涵盖基础设施、服务层、跨平台框架、UI组件库、小程序以及工程化等方面：3 基础设施依托于腾讯云服务的能力，腾讯沉淀了强大的基础设施能力，这里只摘取了一小部分和前端技术体系相关的服务。CDN作为静态资源分发已经得到广泛运用，对于用户体验的提升有极大的作用。腾讯云除了在全网有着快速、稳定、智能、安全的内容加速服务，还能够支持海外加速、全球应用加速等能力，对于全球化应用可以起到很好的帮助。Serverless作为无服务器的技术服务现在已经成为了各大云厂商的标配，云函数 SCF 是腾讯云为企业和广大开发者们提供的无服务器执行环境，您无需购买和管理服务器，而只需使用平台支持的语言编写核心代码并设置代码运行的条件，代码即可在腾讯云基础设施上弹性、安全地运行。腾讯云完全管理底层计算资源，包括服务器 CPU、内存、网络和其他配置/资源维护、代码部署、弹性伸缩、负载均衡等。代码按需运行，空闲时不收费。使用云函数将帮您免除所有运维性操作，使您更加专注于核心业务的开发，实现快速上线和迭代，把握业务发展的黄金时期。腾讯云还提供了关于视频直播、短视频、网络安全、大数据可视化平台、小程序云开发解决方案、测试服务、监控服务等等能力、极光推送等等能力。其中， HTTPDns 解析服务提供了稳定中立的第三方DNS解析服务，有效的解决了DNS劫持、DNS解析速度等问题，可以有效提升用户体验。极光推送更是作为国内移动APP推送的主要解决方案，集成了iOS、Android的推送能力，解决了国内Android机型分散，缺乏统一的推送能力的问题，具备了每日数亿信息量的处理能力和极高的到达率。4 小程序微信小程序微信小程序在2017年推出，是一种不用下载就能使用的应用，已经构造了新的小程序开发环境和开发者生态。现在已经有超过150万的开发者加入到了小程序的开发，小程序应用数量超过了一百万，覆盖200多个细分的行业，日活用户达到两个亿。微信小程序是一个真正现象级的平台型产品，改变了许多人使用App的方式。而且随着微信小程序的成功，各大互联网厂商都开始开发各自平台的小程序，同时手机厂商也联合起来开发快应用平台。小程序的渲染层和逻辑层分别由 2 个线程管理：渲染层的界面使用了 WebView 进行渲染，逻辑层采用 JsCore 线程运行 JS 脚本。为什么要这么设计呢？前面提到的管控和安全，为了解决这些问题，我们需要阻止开发者使用一些浏览器提供的，诸如跳转页面、操作 DOM、动态执行脚本的开放性接口。逻辑层 ：创建一个单独的线程去执行 JavaScript，在这个环境下执行的都是有关小程序业务逻辑的代码渲染层 ：界面渲染相关的任务全都在 WebView 线程里执行，通过逻辑层代码去控制渲染哪些界面。一个小程序存在多个界面，所以渲染层存在多个 WebView 线程同时，小程序的资源文件是下载到本地缓存进行加载、渲染、运行，类似于原生App中Hybrid离线包的方式，能够提供了非常好的性能体验。wepy - 小程序组件化开发框架原生小程序开发方式相对比较封闭，无法利用前端开发的完整体系生态，于是wepy就希望通过组件化、现代前端式的开发方式引入到小程序开发中。WePY (发音: /'wepi/) 项目启动于 2017 年 11 月份， 是小程序最早的框架之一，是一款让小程序支持组件化开发的框架，通过预编译的手段让开发者可以选择自己喜欢的开发风格去开发小程序。框架的细节优化，Promise，Async Functions的引入都是为了能让开发小程序项目变得更加简单，高效。特性：使用 Vue Observer 实现数据绑定支持 Vue watch/computed/mixin 等特性基于原生组件实现组件化开发支持 TypeScript小程序开发框架目前在业界已经百花齐放，下图就是一个对比，可以看到对于小程序多端开发的诉求是非常高的，wepy对于小程序类型支持略显不足，同时也没有移动端容器支持的能力，但其在流行程度和组件丰富度上还是占据优势。westore - 微信小程序解决方案github.com/Tencent/wes…受 Omi 框架 的启发，且专门为小程序开发的 JSON Diff 库，所以有了 westore 全局状态管理和跨页通讯框架让一切尽在掌握中，且受高性能 JSON Diff 库的利好，长列表滚动加载显示变得轻松可驾驭。总结下来有如下特性和优势:和 Omi 同样简洁的 Store API超小的代码尺寸(包括 json diff 共100多行)尊重且顺从小程序的设计(其他转译库相当于反其道行)增强 data 数据绑定，函数属性可直接绑定到 WXMLthis.update 和 setData 语法类似，但返回一个Promisethis.update 比原生 setData 的性能更优，更加智能Westore 专为小程序插件开发定制了模板Westore 集成了腾讯云开发解决了小程序的痛点:使用 this.data 可以获取内部数据和属性值，但不要直接修改它们，应使用 setData 修改setData 编程体验不好，很多场景直接赋值更加直观方便setData 卡卡卡慢慢慢，JsCore 和 Webview 数据对象来回传浪费计算资源和内存资源组件间通讯或跨页通讯会把程序搞得乱七八糟，变得极难维护和扩展5 UI组件库WeUIWeUI 是一套同微信原生视觉体验一致的基础样式库，由微信官方设计团队为微信内网页和微信小程序量身设计，令用户的使用感知更加统一。WeUI提供了表单、基础组件、操作反馈、导航相关、搜索相关、层级规范等方面的组件库，下图就是部分表单、列表、选择器的组件示例。通过这套UI组件库，可以在微信Web生态中打造出和微信原生体验一致的界面风格，可以保证用户的体验。腾讯云图腾讯云图（Tencent Cloud Visualization，TCV） 是一站式数据可视化展示平台，旨在帮助用户快速通过可视化图表展示海量数据，10 分钟零门槛打造出专业大屏数据展示。精心预设多种行业模板，极致展示数据魅力。采用拖拽式自由布局，无需编码，全图形化编辑，快速可视化制作。腾讯云图支持多种数据来源配置，支持数据实时同步更新，同时腾讯云图基于 WEB 页面渲染，可灵活投屏多种屏幕终端。6 跨平台Hippy - 多端一体化方案Hippy 作为前终端的一体化方案，其拥抱W3C标准，通过自绘和源生混合绘图组件复用以追求极致性能，并不断接入实现更多优质组件。其已经在浏览器上应用了数十个内外部业务，承载了数十亿计的用户访问量，拿下了公司内部2018年年度代码文化奖。对于多端一体化的研发方式，业界一直在探索，例如React Native、Weex实现了通过JS编写、Native渲染很好的平衡了研发效率和渲染效率，但是依旧无法直接实现Web/Native的多端一体化，因此依旧需要寻找一个框架可以在多端实现跨平台、高性能、动态化发布的开发解决方案。项⽬目架构 Hippy SDK 采⽤用三层设计，其中：JavaScript 层：提供业务代码运⾏行行时的前端上下⽂文环境；目前支持前端主流框架，例如React、VueC++ 层：JavaScript运行时接口的封装；任务调度器包含延迟任务、优先级管理、事件循环等等；提供基础 UI 组件与布局计算框架，并负责渲染⾄至⽬目标平台；Native Framework 层：负责前终端通讯与 JavaScript VM，并提供 Native 相关模块；从Hippy-React架构中可以看到其如何支持三端：Web端：依赖Hippy-React-Web将Hippy React代码转换成React-Dom，然后再渲染到Web浏览器Android/iOS：通过运行时的C++布局引擎对Hippy React代码进行解析得到类似React Element对象，里面会含有组件对象的基本属性(name/props/events等)，再通过React-Reconciler进行转换成对应的FiberNode，然后再通过Native Renderer渲染出原生组件。Hippy目前来看拥有以下特点：拥抱社区：即将开源，同时会紧跟W3C标准，将来开源后可能会有更多的社区去丰富其组件追求性能：采用Binding模式的前终端通讯方式，提升Web和Native之间的通信性能，同时基于C++的接口封装、任务调度、UI/布局计算框架等等，都达到了高性能渲染能力更多组件：支持Canvas、Lottie/PAG动画、腾讯地图设计适用：设计稿直出代码omi - 前端跨端平台Omi (读音 /ˈomɪ/，类似于 欧米) 是跨框架框架，基于 Web Components 设计，也可以使用相同语法的 omio 兼容 IE8+。支持 PC Web、移动 H5 和小程序开发(One framework, Mobile & desktop & mini program)。相对于React或者Vue现在主流的前端框架而言，Omi有以下特点：4KB 的代码尺寸， 比小更小顺势而为，顺从浏览器的发展和 API 设计， Webcomponents + JSX 相互融合为一个框架 Omi，Webcomponents 也可以数据驱动视图, UI = fn(data)Shadow DOM 与 Virtual DOM 融合 ，Omi 既使用了虚拟 DOM，也是使用真实 Shadow DOM，让视图更新更准确更迅速类似 WeStore 体系，99.9% 的项目不需要什么时间旅行,也不仅仅 redux 能时间旅行,请不要上来就 redux，Omi store 体系可以满足所有项目基于omi，现在已经有了一整套完整的生态支持：omip：小程序和H5跨端开发omix：小程序开发框架omi-router：路由omi-cli：脚手架工程...Kbone - 前端和小程序同构框架Kbone 这个方案出现，源自于一个需求：微信开放社区当时只有 Web 端，为了让信息可以更方便地传播、分享和使用，希望实现社区小程序版，交互体验尽量贴近于 Web 端。此次同构到小程序端需要考虑几个因素：多端代码复用、尽可能支持已有的特性和性能要有保证。其实最主要的就是要在尽量不改动现有代码的情况下来完成小程序的开发。Kbone 这个适配器方案的大致设计思路，我们将其归纳为两个模块： 仿造接口和自定义组件。正因为这个方案是通过提供适配器的方式来仿造出 Web 环境，所以用户代码不需要做任何魔改，大部分特性都可以继续使用不需要被删减，比如 vue-router、window.location 操作等。不同于其他前端和小程序同构框架通过 语法转译 的方案，Kbone通过实现仿造Dom接口，从而让上层前端代码无须太多改变。Kbone 这套方案最大的优势：扩展性强、对各个特性的支持全面、对代码编写的要求少以及自由度高、不需要魔改 Web 框架的底层实现，这样对于代码的维护、升级也都更为简单方便。7 工程化腾讯Now直播团队在2019 ArchSummit大会上分享了团队在工程化相关建设的思考，可以给到不少启发。前端工程化不再是简单的Webpack打包、部署而已，从完整的研发流程来看，可以涵盖创建项目、本地开发、功能测试、发布、线上监控多个环节，每个环节又有各自需要建设的基础能力，只有有了这些Devops的能力，才能促使研发团队技术的标准化，提高研发运维效率。分享中重点提到了打造前端工程化几个方面的思考：本地开发：基于CLI/GUI打造一体化工作流 。由于各个团队的技术栈不一样，导致每个团队使用例如create-react-app或者vue-cli等不同的cli工具。在创建项目时，往往也是简单通过项目复制。为了解决这个问题，基于开发套件和插件方案，可以实现在项目创建、本地开发、发布等环节实现统一的cli工具，统一了研发流程。部署发布的演化 。团队经历了三个阶段：1）手工发布，依赖手工配置实现打包发布。2）基于Jenkins实现了一定的自动化，但系统无法进行自定义。3）自研CI，基于docker并且打通企业微信进行消息通知，实现了代码提交、分支合并、持续部署等能力。团队工具平台实践 。沉淀了从质量、性能、效率等方面完整的工具集，可以有效沉淀最佳实践，提升团队的基础能力。团队规范：开发、协作规范制定和落地 。包含开发规范（各种代码编码规范），协作规范（git规范、分支规范、文档规范、commit规范等），发布规范（监控告警规范、发布checklist规范、离线包规范）。在代码规范通过eslint方式落地，并且集成进入CI流程，git commit也通过工具进行检查。写在最后腾讯给大家的感觉一直都是产品驱动、闷声发大财的样子，而且从技术方面由于有阿里、百度这类技术沉淀深厚的公司作为对比也没有给人留下深刻的印象。但是，最近几年随着微信平台的崛起，围绕微信平台的开发框架、跨端同构方面获得了比较大突破，同时，也举办例如TWeb conf、腾讯Live开发者大会，在业界的影响力也不断扩大。本篇文章力图从前端各个方面去整理总结腾讯当前的技术体系，但一定会有许多遗漏，同时开源信息毕竟有限，希望相关同学可以一起多多交流。这是大厂前端技术体系解密系列第三篇，后续还会有其他大厂的内容，精彩还将继续，有兴趣的同学可以关注本公众号【奶爸码农】第一时间获得信息。"}
{"title": "Cool社区站长经验之谈：微信小程序学习路线 ", "author": "admin", "pub_time": "2016-10-12 18:43", "content": "一、入门其实非常简单，在http://www.hubwiz.com/course/54ee8d2de564e519b8f8dad3/将这个JavaScript基础课程学完即可，大概花费一到两天时间，交互式学习，非常容易理解。二、然后开始阅读微信官方文档：https://mp.weixin.qq.com/debug/wxadoc/dev/index.html大概一个多星期基本上开发微信小程序没有太大的问题了。 （这里需要注意的一个问题是，如果你的小程序涉及到后端开发，那么前面的知识不足让你开发应用的，学习后端知识太耗费时间了，不如找个合作伙伴一起做，如果非要学习后端开发，那么我建议学习nodejs，nodejs是后端开发学习成本最小的，nodejs学习路线我就不写了，网上很多，如果想快速做微信小程序，最好别先学后端开发。） 阅读流程如下：1、下载工具并安装https://mp.weixin.qq.com/debug/wxadoc/dev/devtools/download.html?t=14746440893592、学习工具使用https://mp.weixin.qq.com/debug/wxadoc/dev/devtools/devtools.html?t=14746440896043、根据简易教程步骤来做https://mp.weixin.qq.com/debug/wxadoc/dev/?t=14746440829124、体验demohttps://mp.weixin.qq.com/debug/wxadoc/dev/demo.html?t=14746440831325、学习框架原理https://mp.weixin.qq.com/debug/wxadoc/dev/framework/MINA.html?t=14746440829126、学习界面组件https://mp.weixin.qq.com/debug/wxadoc/dev/component/?t=14746440912867、学习API使用https://mp.weixin.qq.com/debug/wxadoc/dev/api/?t=1474644087418 OK，动手自己做项目。 注意，要看微信小程序设计指南喔  ：https://mp.weixin.qq.com/debug/wxadoc/design/index.html"}
{"title": "金融小程序市场调研概述 ", "author": "Rolan", "pub_time": "2019-6-19 00:02", "content": "用完即走是小程序的目标，不管小程序满足了用户的何种需求，如果不能促使用户高频使用，并且促进用户的裂变，则这款小程序本身就不具备成功的因素。一、 分析目的小程序是是移动互联网时代的第二次大变革，上一次变革，是从PC互联网转移到移动互联网。本次对小程序进行调研分析，有以下几点目的：第一，让初入小程序的新从业者，了解小程序的发展过程及前景；第二，总结各家小程序市场的优势，以便进一步选择合适的小程序市场；第三，调研市场上金融交易类小程序的特点，为相关的金融行业进入小程序提供参考。调研分析的终极目的是通过了解和熟悉小程序，进而为公司的小程序规划、开发和运营提供参考。二、 小程序分析1. 小程序的产生在PC电脑时代，因PC电脑的使用场景只限于在办公室、家庭等环境中，电脑携带不便，使用场景受限，无法与生活产生更多的连接。自进入移动互联网时代以来，互联网行业的发展更加繁荣。手机是移动互联网的载体，APP是连接的通道，人们通过APP与生活进行链接。生活的场景越多，链接越多，再加上同行业有无数个竞争者，就有成倍数量的APP产生，移动互联网时代，给人们提供便利的APP逐渐成为了负担。APP需要下载，下载后需要安装，会占用手机的内存，影响手机的运行，同时，使用APP的服务需要手机号和相关信息，各行各业的APP各自为战，无法进行连接与配合，各APP的信息绝缘使之成为了信息孤岛。并且，APP的发展逃脱不了马太效应，一批头部APP拥有的了绝大部分市场占有率，新型的APP很难再脱颖而出。行业的变革契机即将到来。2015年，微信之父张小龙开始思考APP更轻量的形态——应用号；2016年，应用号改名为小程序，在腾讯内部进行研发和测试；2017年1月，小程序正式上线，无需下载，无需安装，不占用手机内存，无需注册，用完即走的小程序，依托微信APP诞生了。2. 小程序的发展自微信小程序发布以来，小程序成为了移动互联网的时代的下一个风口；除了腾讯，各大公司都在依托自己的生态体系，推出属于自己的小程序生态：2017年1月，微信小程序上线；2017年9月，支付宝小程序开始公测；2018年7月，百度智能小程序正式上线；2018年9月，今日头条小程序正式发布。以上是国内小程序生态的F4集团。 小程序的发展格局是以BAT为首的互联网巨头们延续本身的优势，并且，在争夺对小程序的定义，它们都试图将小程序作为一种基础能力，扩展平台生态的边界，甚至成为所有 app 补足自身能力的底层技术。小程序的理念率先由微信的张小龙提出，以微信社交的用户基数优势明显；支付宝小程序着重赋能消费与金融场景；百度智能小程序以搜索，信息流和AI实现精准分发；头条小程序是针对头条生态体系的内容创作者的延伸和变现。小程序的本质，是依托超级APP的轻应用。除了BATJ的小程序之外，另外一股隐形的力量值得关注，那就是依托手机应用商店的快应用诞生了。2018年3月，华为、小米、OPPO、VIVO、中兴、金立、联想、魅族、努比亚9大手机厂商共同推出“快应用”，快应用依托的是安卓手机系统和应用商店，只要是使用国内的这9大品牌的手机，都能快速开启快应用，快应用和小程序一样，不需要安装，直接点击就可以使用。小程序和快应用，都是移动互联网时代针对APP的一次革命。3. 市场及用户分析随着移动互联网的繁荣发展，手机已经成为了人们生活中不可或缺的一部分，依托手机产生的用户流量，是整个移动互联网市场得以发展的基础，没有用户流量，就没有移动互联网。在小程序之前，APP的用户流量的来源用户下载APP，使用APP，随着APP的弊端越来越严重，用户对APP产生了疲劳，已经严重制约了移动端用户流量的成长，进而影响了整个行业的发展。而在商家方面，APP的运营也需要极大的运营成本，却收效胜微。小程序产生以后，用户使用新服务的门槛降低（不在需要下载APP和注册信息，也不会影响手机的运行等），用户体验感增强，这极大的促进了移动互联网的流量的快速增长，流量的增长，也是代表了整个移动互联网的增长。在商家方面，商家依托BAT的小程序，能随着用户场景的不同，提供和满足用户的丰富需求，从而更极大的促进了商家市场的发展。当小程序产生以后，由APP弊端所阻碍的用户流量，成倍的迸发出来，并涌入到小程序生态中，商家根据小程序生态的流量，提供个性化的服务，促进了小程序的活跃。引用业界人士的看法：“H5的体验从未令人满意，APP的割裂找不到解决的路径。小程序将是用户体验的一次革命性升级。用户体验升级，这也意味着曾经阻碍移动互联网真正开放的的关键门槛被打破。”4. 小程序特点分析各小程序的特点及优势劣势：各小程序的载体、入口及头部应用：在各小程序中，微信拥有觉得用户体系和社交资源，但是生态过于封闭，当前是小程序市场中绝对的霸主。而百度是曾经PC时代最大的流量主，在百度智能小程序全放开的姿态下，未来百度小程序的发展前景值得期待。支付宝本身就被用户定义为一款工具，其在金融和生活服务方面的优势，让支付宝小程序更适合作为工具型的小程序。5. 小程序市场数据因小程序市场格局以BAT为主，并分属BAT三家公司的各自的生态系统，相关的数据只能依赖于官方发布的数据，头条小程序和快应用的相关数据暂时无法收集到，下面是搜集到的BAT小程序的具体数据情况：微信小程序：截止2018年7月，微信小程序超过100万个，开发者数量超过150万，2000款小游戏。小程序累计用户数突破6亿，在此期间，小游戏、618电商节功不可没。百度智能小程序：截止2018年12月，智能小程序月活用户已经超过1.5亿，累计用户数超过3亿，服务已经深入到政策民生、娱乐、资讯等23个大行业，覆盖了262个细分领域。支付宝小程序：截止2018年9月，支付宝小程序的数量已经达到2万+，累计用户数量达到3亿+，日活跃量为1.2亿+。从数据来看，微信小程序已经是绝对的巨头，从小程序数量，到开发者数量，再到用户数量等方面，都是其他小程序无法企及的高度。而随着百度小程序的全开放模式，未来或许会形成微信小程序第一，百度第二的两强局面。至于支付宝小程序，用户感知度目前较低，支付宝在宣传和推广方面也比较低调，还不好评估未来形势。6. 小程序的参与角色小程序作为一个新兴的应用，其发展情况离不开市场的参与者，在小程序的整个市场中，参与的用户包括如下角色（1）应用开发者小程序应用包含3类开发者，第一是市场中的超级APP品牌，除去一些功能较为复杂的产品，大多超级APP也都推出了小程序；第二是完全基于小程序生态的创业开发者不断增加；第三最相关场景的线下商家，比如餐饮和生活服务，通过扫码、卡券、识别码等场景来应用小程序的开发者。（2）应用消费者目前约有10C端用户，以微信数据为例，小程序累计用户数超过6亿，C端用户在一线城市占比接近一半，另外一半是二三四线城市，男女均衡，使用频率和时长正在逐步攀升。（3）SaaS服务商目前SaaS服务也包含3类开发者，首先是基于公众号的服务商推出的小程序模板，如有赞、微盟等；其次是专门针对小程序服务的新服务商，如好物满仓、小店铺、小电商等；最后是原本渠道平台的服务拓展，如京东开普勒、LOOK内容电商等。（4）应用助手小程序应用助手目前有第九程序、大梦想程序、知晓程序等。（5）垂直媒体除了TMT媒体的小程序垂直专栏，专门针对小程序领域的垂直媒体包括阿拉丁、知晓程序，还有自媒体公众号晓程序观察和造程序等。（6）数据助手一方面是官方提供的小程序数据助手，另一方面是第三方数据平台提供的数据工具，如阿拉丁、新榜等。（7）乙方传统的IT外包开发团队，针对小程序的定制开发服务。这7类用户构成了目前小程序的整体用户生态，除去C端用户以外，大多都是小程序服务链体系的补充。7. 小程序资本投资小程序作为一个新兴的市场，已经大有取代APP的趋势，随着微信的全力推动，小程序成为新的创业风口，引得巨头们纷纷下场，市场热度升温，资本也纷至沓来。据新榜数据显示，2017年共有超过30家小程序平台获得融资，融资规模多为百万或千万量级，其中融资规模最大的小电在两轮融资内获得接近5亿元投资；从融资轮次来看，种子轮和天使轮是占比较多的轮次。2017年是微信小程序发力的初年，众多小程序仍处在项目早期，沉淀的用户数据以及交易闭环尚不成熟，投资机构的出手为卡位策略，以观察小程序后续发展到2018年，小程序进入活跃状态，热钱涌入市场。据新榜统计显示，去年微信小程序领域共出现130次融资，总金额超过43亿元，是2017年的6倍之多；融资轮次上，A轮占比以33.09%位居第一，有10家小程序一年内获两轮及以上融资。2017-2018年腾讯参与投资的小程序，来源于地歌网资本市场对小程序的投资，也是认可了小程序前景，提前对相关的投资进行布局。其中，腾讯作为小程序类企业投资的领头羊，也代表了腾讯对小程序的绝对看好，是小程序市场未来持续成长重要保证。三、 金融小程序分析1. 小程序的金融环境对于金融行业来说，微信小程序的出现会为金融及其细分行情的互联网金融发展提供新的创新热点。2017年1月9日，小程序第一次上线时，就在金融圈内掀起了一股热潮。短短一周内，在金融领域，第一批就已有超过 20 家的机构开始尝鲜微信小程序，包括证券、银行、基金等，上线最齐全的是xx证券的微信小程序，xx证券的微信小程序服务最为齐全，能够提供行情、自选、资讯、交易、查询等功能。然而，任何金融领域的创新都是一把双刃剑。1月19日，监管机构基于政策及风险管控的因素考虑，金融类小程序被紧急叫停，叫停的小程序主要包含金融的开户、交易等业务。自此之后，金融类小程序在发展上受限，相关金融机构不能再依托小程序的便利性开展与交易相关的业务，只能提供基础的信息浏览等。众多一线金融机构也不再考虑依托小程序开展市场业务，基本都退出了小程序市场。2. 金融小程序格局自从金融机构小程序被监管机构踩紧急刹车之后，微信也会针对私自上线的交易类小程序进行审核把控，整个小程序市场的金融小程序数量已经屈指可数，下面从数据统计方面来查看金融小程序的市场格局。下图是8家小程序商店及统计平台获得的金融小程序收录情况（百度和支付宝小程序无直接分类）：上图中的数据，是在小程序商店中，按照金融类别来统计的，包含了信用卡、网贷、理财、投资、银行、股票、证券、基金、记账、保险、创投、资讯、房贷等等细分类别（细分类别无法统计），而在百度小程序、支付宝小程序和头条小程序的列表展示页面，因无类别筛选功能，则无法统计。各家统计的小程序数量大有不同，这也代表了小程序商店实力的不同。现在小程序的数据统计及各类别无法进行准确统计，只能依照小程序的名称进行搜索，而小程序的名称是是营销的一种手段，和小程序本身的功能和交易会有差异性，所以无法一一统计金融小程序下面的细分状态是资讯类的，还是模拟交易类的，还是工具类的。因金融监管的影响，金融小程序一直处于原地踏步的状态，而其他行业如电商、小游戏则不断发展壮大。四、 调研对象根据金融小程序的现状和本行业特点，需要选择一批与本行业具有相关性，同时具有用户交易功能的和模拟比赛功能的小程序进行调研，选择的调研对象包含以下方面：国内股票类、港股美股、期货交易类、外汇交易类的小程序，现选择的调研小程序详细情况如下：根据小程序目前的状况，选择了7个微信小程序（包含交易功能类的）、2个百度智能小程序（包含信息查询和资讯）和1个支付宝小程序（基金模拟交易）。选择上面10个小程序进行调研，既与本的相关业务有所关联，也符合小程序目前的市场格局，并能够详细分析出BAT三家小程序不同的用户体验。五、 调研分析根据这10个小程序的不同，分别从小程序的主体、入口、功能及特点、用户需求满足、分享、登录等方面对小程序进行详细分析，以详细对比各个小程序的功能优势、特点、服务人群等。1. 主体信息在调研的10个小程序中，小程序的主体信息分属北京上海和深圳三地，其中北京地区7家，上海1家，深圳2家。其中有6个小程序属于知名企业的，分别是xx、xx、xxxx管理、xx、大xx。在小程序与公众号的绑定关系上，腾讯的小程序具有与微信公众号的绑定服务，有3个小程序是与微信公众号绑定运营的。支付宝小程序小程序与1个支付宝下的公众号绑定运营的。2. 功能和业务类型在调研的10个小程序中，所属行业都是金融行业，有7家与股票有关，有3家与外汇有关，有1家与基金有关。它们的功能类型分别是模拟交易、交易比赛、股票查询和股票资讯四种，运营的形式主要是模拟交易、有奖比赛机制、基本查询、信息资讯四种方式。3. 入口及裂变功能小程序入口是指在小程序载体（微信APP、支付宝APP、百度APP）上时如何进入小程序，根据小程序类型的不同，微信小程序支持从下拉任务栏、发现栏目的小程序二级菜单中进入，同时其他进入入口还包括用户分析、微信公众号入口等渠道。支付宝小程序的入口还不太习惯，需要先从搜索栏搜索，然后选择小程序，其次是从小程序收藏里面进入。百度小程序可以从个人中心的一级入口进入，或者从一级搜索里面的小程序搜索寻找。小程序裂变功能是小程序流量快速增长的关键，本次调研中，把10个小程序的裂变分为外部裂变分享和内部裂变分享两种模式。外部裂变式指官方支持小程序的跨生态分享功能（比如百度的支持分享到微信和微博）。内部裂变式指在小程序内部，小程序服务提供商在小程序功能上设计了相关的分享功能（比如邀请点赞、分享获得模拟金币等）。在外部裂变分享中，微信不支持分享到外部生态体系中去，而支付宝和百度为了获得微信的社交用户，是支持分享到微信、微博等其他体系的。在调研的10个小程序中，微信小程序内的xx模拟场、股神争霸和讯、xx指数天梯3个小程序支持内部裂变分享；支付宝小程序的1个调研对象不支持内部裂变，百度小程序1个小程序百股精支持内部裂变分享。 同时，在微信内置的转发功能中，微信7个小程序只有6个支持转发，还有1个不支持转发。4. 账户信息及使用引导小程序是一个生态体系，用户在使用小程序时，根据各小程序的业务情形，用户被分为两种角色，分别是登录用户和游客两种。在调研的10个小程序中，有6个需要用户登录，登录的方式均为小程序生态的个人信息（用户名、昵称、头像等），有4个不需要用户登录。除了获取用户的个人信息，是否需要手机号授权也是一个重要设置，10个小程序只有2个微信小程序需要获取用户的手机号码。对于新用户的引导，是提升用户体验的重要形式，在10个小程序中有5个小程序对新用户有引导功能。5. 页面架构了解小程序的页面架构，可以深入分析小程序的业务活动。在本次调研的10个小程序中，有2个小程序比较复杂，业务活动多，页面数量为20+，可看成是一个小型的APP；4个小程序复杂程度一般，平均只有6-7个页面，有4个小程序比较简单，只有一个主页和其他附属页面，业务类型简单明确，而且单一。页面越多，可以看出来小程序的设计及功能体验越复杂，对用户的需求的满足程度也是越高。因此，小程序页面是小程序分析的指标之一。6. 用户需求及频次用户需求、用户黏性、需求频次是评价一个小程序非要重要的指标，只有满足用户的核心需求、需求频次高、用户黏性好的小程序，用户才能进行快速增长，才可能成为一款成功的产品。在调研的10个小程序中，各个小程序的所满足的用户需求、用户黏性、需求频次和裂变功能如下图所示。在用户需求中，从人性原始需求来说，贪小便宜是人固有的贪婪欲望，所以小程序中通过设置xx、设置xx和礼品，让用户觉得可以占便宜，或者有占便宜的期望，满足用户的人性需求，这是产品能够成功的原因之一。同时，通过分享、点赞、邀请的满足用户的社交需求，设置账号等级、排名，强化排名效果，是满足人性的尊重需求。所以，一个好的小程序，肯定能够从多层次满足用户的需求。在需求频次中，主要看产品的核心服务需求和对用户的引导需求。在金融行业中，根据产品交易时限的不同，外汇、期货类产品的交易频次较高，而股票类交易频次一般，基金交易的需求频次最低。产品的交易时限直接影响了小程序的需求频次。用户黏性，指的是客户对于品牌或产品的忠诚、信任与良性体验等结合起来形成的依赖感和再消费期望值。依赖感越强，客户粘性越高；再消费期望值越高，客户粘性越高。对小程序来说，就是指用户关闭小程序后，用户再次打开小程序的频率，再次打开的频率越高，用户黏性越高。小程序最主要的特点是用完即走，用户走了以后，如何使用户再来使用，是小程序比较核心的功能之一，比如通过社交需求、提醒需求、赛事提醒等多种角度，唤醒用户再次打开，便能提高用户的黏性。裂变功能是小程序用户量增长的关键，用户增长是小程序的核心目标，通过用户裂变，能够快速扩大小程序的影响力，进而使小程序更加成功。7. 总体评价针对本次调研的10个小程序，依照用户体验、用户需求、用户黏性和需求频次四个指标对小程序进行评价，占有的指标越多，则评分和评星越高。本次评价中，五星小程序2个，四星小程序1个，三星小程序3个，两星小程序，一星小程序1个。下图是本次调研小程序的评价一览表：以下内容是分别对各小程序的概述和总结评价：xx模拟场：主要进行外汇交易，交易时间无限制，同时，设置了高额的奖金模式，吸引用户参与，在用户体验上包括点赞、邀请、排名、邀请好友、复活等等机制，使得小程序的用户黏性逐步提高，用户的需求频次也逐渐提高，拥有多种用户裂变功能，相当于增加了产品的交易壁垒，所以，从整体上来看，是有可能一款非常优秀的小程序的。模拟交易Konpn：可以进行外汇、期货、股票、指数等多种产品的交易，交易前需要选择品种，随后就可以按照正常的交易流程进行下单、买入、卖出、委托等操作，用户体验差（打开慢），用户黏性低，需求频次主要看用户的交易需求是否愿意持续进行模拟交易，无裂变功能，本质来看，只能算是一款模拟交易工具。股神争霸和讯：主要进行股票交易，还可以参与美股，小程序在玩法上有多种多样，分别有预选赛、VIP赛制（充钱购买VIP）、竞标赛、擂台赛、练习场、指数天梯（猜行情赢奖品）、智能选股、拜师傅等多种玩法，在玩法中设置了可以赢取现金奖励，同时，还能进行分享转牛币等，用户黏性高，用户需求频次高，满足了多种用户需求。在本次调研的10个小程序中，股神争霸和讯算是玩法最多最复杂的小程序，同时，也是唯一拥有变现手段的小程序。依托于xx的一些资源，可以算得上是一款比较成功的小程序。xx指数天梯：这是一款简单玩法的小程序，通过猜上证指数的上涨和下跌，猜中就获得对应的金币，同时相当于在梯子上上升一梯，猜错或者不猜则下降一梯，总共20关，每一梯都有对应的奖励，第20关有RMB奖金。玩法简单，易于接受。没有用户需求和黏性，此小程序如果单一投放，不能算是一款成功的小程序，但是它依托的是xx小程序，算是一种补充玩法，因此，这个小程序有一定的借鉴意义。模拟盘感训练：就是从某一外汇货币货币走势中截取一段走势，然后在25个交易日，让用户选择看涨、看跌、观望还是平仓，以此来计算收益，最后根据收益来获得称谓，同时引导用户开实盘账户或者下载APP，这个小程序对用户的引导过一单一，无法满足用户的交易需求和其他需求，只能算是一段行情体验工具，最后引导用户下载APP的使得公司目标过于明显，影响客户体验。雪球练K：和模拟盘感训练是一款几乎相同玩法的小程序，差异在于雪球练K是针对的股票行情，同时，在UI设计上更加优秀一些。模拟炒股票：提供的是一个股票交易页面，用户有5个操作菜单，分别是持仓、买入、卖出、撤单、查询，体现了一个完整的股票模拟交易功能，同时，有交易规则和营销宣传功能（大连华讯投资股份有限公司），用户体验低、用户黏性低，只算一个工具。华夏模拟炒基：这是一个支付宝小程序，提供的是基金模拟交易功能，主要以积分和礼品作为吸引用户的动力，整体情况来看，UI设计体验好，用户引导和操作体验强，是一款优秀的小程序。缺点是支付宝小程序的用户量相比腾讯比较少，用户裂变能力不足，同时，限于基金交易的超过过程叫长，影响了用户的交易体验，需求频次低、用户黏性低。百股精：这是一个百度智能小程序，是百度的官方出品，主要的功能是查看股票行情，分为自选和行情，可以查看的股票类型包括沪深股票、港股和美股，功能精简，是一款简洁的股票查询工具。同时，在小程序是引导到东方财富进行开户的广告，算是一个间接的变现渠道。有鱼港股美股复盘：这是一个百度智能小程序，在所有调研的小程序中，这是最简单的小程序，只有一个页面，分为三个部分，分别显示美股复盘、有鱼早头条、港股公司新闻，就是一个资讯小程序，缺点是：资讯内容较少，页面单一，无法满足用户的资讯需求、无用户黏性可言。六、 调研总结通过本次的小程序市场调研，总结如下：1. 微信小程序是市场主流在本次调研报告中，分别从小程序的产生、小程序的发展过程、小程序市场及用户、各家小程序的特点、小程序的市场数据、小程序的资本投资、小程序的参与角色等7个方面，详细介绍了小程序市场目前的状况。就目前的情况来看，微信小程序在整个小程序市场的独霸一方，并且已经形成了完整的上下游市场关系链。同时，依托微信巨大的用户体量和社交需求，小程序在微信生态中容易快速成长和发展，这也是微信小程序的市场能快速成长的原因。而百度和和支付宝，其优势不在于次，所以小程序的传播和成长较低，市场发展缓慢，百度小程序和支付宝小程序还在发育和成型的过程中，市场发展格局还有待观察。所以，新进入者在开发小程序时，优先选择的市场应该是微信小程序。2. 用户需求和用户裂变是核心一个小程序要想快速实现用户增长，从而成为一款成功的小程序，则应该注重小程序的核心：用户需求和用户裂变。满足了用户的核心需求，比如马斯洛需求层次的种的生理需求、安全需求，或者说是人类本能的原始欲望：性欲、懒惰、傲慢、嫉妒、愤怒、贪婪、食欲，则小程序成功的概率增加了50%。比如阿拉丁上统计排行榜上前十的小程序：拼多多、小年糕、同程旅游、美团、京东购物、欢乐斗地主等，它们满足的需求有：贪便宜、娱乐、买票、用餐、购物、娱乐等人性的基本需求。在用户裂变方面，能够给用户提供足够的动力，让用户自发的进行分享、转发和邀请，是小程序成功裂变的基本保证。如何为用户提供裂变动力，是产品成功必不可少的保证。比如当用户想回家，但是抢不到票时，通过转发小程序邀请朋友助力，满足条件就能抢到票，回家的动力会自发的促使用户进行转发，而被邀请助力的一方，主动帮忙或者碍于情面也会促进整个用户裂变的过程。在裂变过程中的阻碍作用则包括用户分享的东西是否违反公序良俗及被邀请人的个人价值观。所以，人性的原始需求会自发的产生用户裂变的动力。3. 金融小程序调研总结在本次调研的10个金融小程序中，因政策监管的因素，从总体情况来看，小程序提供的服务都是以模拟交易为主，在模拟交易中，外汇、期货、股票是常规三大品类。所以，要想在小程序中开发一款成功的金融小程序，脱离不了模拟交易这个功能。因为只有模拟交易，才能使小程序成为一个需求高频的产品。其次，要想在金融小程序中提高用户黏性，则需要能够满足用户的原始欲望，如贪小便宜、娱乐等功能，比如，设置比赛奖金、设置积分兑换礼品，才能为用户提供原始动力，促进用户的交易、转发、分享等功能。从调研的10个小程序中也可以看出，单一功能的小程序只算得上是一款工具，而无法实现公司的多重目标（拉新、用户转换、导流等）。用完即走是小程序的目标，不管小程序满足了用户的何种需求，如果不能促使用户高频使用，并且促进用户的裂变，则这款小程序本身就不具备成功的因素。 本文由 @风萧雨下 原创发布于人人都是产品经理。未经许可，禁止转载题图来自Unsplash，基于CC0协议"}
{"title": "从零开始一个微信小程序版知乎 ", "author": "yuzeng84", "pub_time": "2019-6-27 11:19", "content": "以前工作没直接进行过小程序的开发，最近闲了下来就赶紧学习一下。因为从零开始，所以没有使用任何框架及UI库，记录一下本次开发中踩过的坑吧~\n展示效果(界面样式设计与交互来自iOS 4.8.0版本知乎App)：\n\n动态效果请移步到GitHub查看。\n一、开始前的准备\n\n申请账号：根据小程序注册文档，填写信息和提交相应的资料，就可以拥有自己的小程序帐号。\n开发工具：微信开发者工具\n数据来源：\n\nEasy Mock: 一个数据模拟神器，可以根据自己需要的格式自己编写返回数据，而且所有的数据都是随机生成的。\nMock.js: Easy Mock引入了Mock.js，但是文档中仅提供了部分语法，要想自己的mock数据写的更精简，可以在Mock.js中查看更多具体语法。\n\n\nicon: 阿里巴巴矢量图标库\n\n二、初始化一个小程序\n\n新建一个空文件夹\n打开微信开发者工具，按照“你的第一个小程序”文档中的步骤即可创建一个自己的小程序。\n目录结构\n\nweChatApp\n|___client\n|\t|___assets \t\t\t\t// 存储图片\n|\t|___pages  \t\t\t\t// 页面\n|\t|\t|___index // 首页\n|   |\t\t|___index.wxml  // 页面结构文件\n|\t|\t\t|___index.wxss  // 样式表文件\n|\t|\t\t|___index.js    // js文件\n|\t|___utils \t\t\t\t// 全局公共函数\n|\t|___app.js   \t\t\t// 系统的方法处理文件\n|\t|___app.json \t\t\t// 系统全局配置文件\n|\t|___app.wxss \t\t\t// 全局的样式表\n|\t|___config.json \t\t// 域名等配置文件\n|___project.config.json\n|___README\n复制代码\n小程序配置文件app.json内容\n\n{\n\t// 页面路由\n    \"pages\": [\n        \"pages/index/index\",              // 首页\n        \"pages/findMore/findMore\",        // 想法页（开始起名为发现页面，后来没改/(ㄒoㄒ)/~~）\n        \"pages/userCenter/userCenter\",    // 更多（同上，原来起名为个人中心o(╯□╰)o）\n        \"pages/market/market\",            // 市场\n        \"pages/searchResult/searchResult\",// 搜索结果页\n        \"pages/message/message\",          // 消息列表页\n        \"pages/titleDetail/titleDetail\",  // 点击标题进入的问题详情页\n        \"pages/contentDetail/contentDetail\"// 点击内容进入的回答详情页\n    ],\n    // 窗口\n    \"window\": {\n        \"backgroundColor\": \"#FFF\",       // 窗口的背景色  \n        \"backgroundTextStyle\": \"dark\",   // 下拉背景字体、loading 图的样式，仅支持 dark/light\n        \"navigationBarBackgroundColor\": \"#FFF\",// 顶部tab背景颜色\n        \"navigationBarTitleText\": \"知小乎\", //顶部显示标题\n        \"navigationBarTextStyle\": \"black\", // 导航栏标题颜色，仅支持 black/white\n        \"enablePullDownRefresh\": true      // 是否开启下拉刷新\n    },\n    // tab导航条\n    \"tabBar\": {\n        \"backgroundColor\": \"#fff\",  // 背景颜色\n\t\t\"color\": \"#999\",            // 默认文字颜色\n        \"selectedColor\": \"#1E8AE8\", // 选中时文字颜色\n        \"borderStyle\": \"white\",     // tabbar上边框的颜色， 仅支持 black/white\n        \n        /** \n        * tab列表，最少2个，最多5个\n\t    * selectedIconPath: 选中时图片\n\t    * iconPath: 默认图片\n\t    * pagePath: 对应页面路由\n\t    * text: 对应文案\n\t    **/\n        \"list\": [{\n            \"selectedIconPath\": \"assets/home-light.png\",\n            \"iconPath\": \"assets/home.png\",\n            \"pagePath\": \"pages/index/index\",\n            \"text\": \"首页\"\n        }, {\n            \"selectedIconPath\": \"assets/find-light.png\",\n            \"iconPath\": \"assets/find.png\",\n            \"pagePath\": \"pages/findMore/findMore\",\n            \"text\": \"想法\"\n        },\n        {\n          \"selectedIconPath\": \"assets/market-light.png\",\n          \"iconPath\": \"assets/market.png\",\n          \"pagePath\": \"pages/market/market\",\n          \"text\": \"市场\"\n        },\n        {\n          \"selectedIconPath\": \"assets/msg-light.png\",\n          \"iconPath\": \"assets/msg.png\",\n          \"pagePath\": \"pages/message/message\",\n          \"text\": \"消息\"\n        }, {\n            \"selectedIconPath\": \"assets/more-light.png\",\n            \"iconPath\": \"assets/more.png\",\n            \"pagePath\": \"pages/userCenter/userCenter\",\n            \"text\": \"更多\"\n        }]\n    }\n}\n复制代码\n配置接口域名: 因使用的是Easy Mock模拟接口数据，因此可以在小程序管理后台-开发设置-服务器域名中将request合法域名配置为https://www.easy-mock.com。\n\n三、开发中的遇到的问题及解决方案\n1、小程序渲染HTML片段\n看了网页版知乎，接口返回的回答数据是一段HTML的代码片段，所以答案中可以在任意位置都插入图片。\n对，没错，就是下面酱紫的(╯°□°）╯︵┻━┻\n\n经过反复尝试，发现原生写法不支持渲染一段HTML代码片段，因此放弃了返回HTML的代码片段的做法，所以我的回答列表中也没有图片(ಥ_ಥ)。\n但在调研中发现了一个自定义组件：wxParse-微信小程序富文本解析组件，还没尝试使用，准备在下次优化项目时尝试一下。\n2、首页的顶部tab切换\n实现思路\n\n每个可点击的tab分别绑定data-index，在最外层bindtap绑定的方法中获取所点击的tab的index值，再根据index的值分别显示对应的tab-content\n\n<view class=\"tab-wrapper\" bindtap=\"setActive\">\n        <view class=\"tab-item {{isActive == 0 ? 'tab-item-active' : ''}}\" data-index=\"0\">关注</view>\n        <view class=\"tab-item {{isActive == 1 ? 'tab-item-active' : ''}}\" data-index=\"1\">推荐</view>\n        <view class=\"tab-item {{isActive == 2 ? 'tab-item-active' : ''}}\" data-index=\"2\">热榜</view>\n        <view class=\"tab-item-line\" animation=\"{{animationData}}\"></view>\n</view>\n<view class=\"tab-content {{isActive == 0 ? 'show' : 'hide'}}\">\n // ...\n</view>\n<view class=\"tab-content {{isActive == 1 ? 'show' : 'hide'}}\">\n // ...\n</view>\n<view class=\"tab-content {{isActive == 2 ? 'show' : 'hide'}}\">\n // ...\n</view>\n复制代码3、上拉加载和下拉刷新\n实现思路\n\n上拉加载：emmmmmm......我指的上拉加载是触底后的加载更多，怕跟大家理解的不一样o(╯□╰)o。\n\n原生方法：onReachBottom，获取到新数据后concat到原有的数据列表后。\n\n\n\n下拉刷新：\n\n原生方法：onPullDownRefresh，将原有的数据列表concat到获取到的新数据后。\n\n\n\n要注意的是，每次对数组进行操作后，都要使用setData对原数组重新赋值，否则数据不会更新的啊( ⊙ o ⊙ )！\n\n4、搜索历史的存储\n实现思路\n\nwx.setStorage、wx.getStorage和wx.removeStorage\n\n存储搜索历史：\n使用wx.setStorage，触发搜索时，检查搜索历史列表中是否含有该字段，如果有则忽略，如果没有则将该字段压入数组中。\n\n\n\n\n显示搜索历史：\n使用wx.getStorage，在显示搜索蒙层时，获取到搜索历史列表，循环显示，当搜索历史列表长度大于1时，显示清空搜索历史的按钮。\n\n\n\n\n删除搜索历史：\n单一删除：每个搜索历史都绑定删除事件，获取到改关键词的index，从渠道的搜索历史列表中删除对应index的关键词，并通过wx.setStorage重新存储。\n全部删除：使用wx.removeStorage，直接移除搜索历史对应的关键字。\n\n\n5、swiper轮播组件\n在想法页的轮播组件中，原知乎App中的xxxx人正在讨论是嵌在轮播模块内的垂直方向的文字轮播，但是小程序中的swiper轮播组件不支持互相嵌套，因此没能实现该部分，只好换一种样式去写/(ㄒoㄒ)/~~。\n\n6、滚动吸顶\n页面中的标题栏在滚动到顶部时，吸顶展示。\n实现效果\n\n实现方案\n\n整个页面使用<scroll-view></scroll-view>包裹，并且绑定bindscroll事件，监听滚动距离。\n设置<scroll-view>为垂直方向时，需设置<scroll-view>的高度。\n复制一个相同的标题栏，添加吸顶样式的类fixed。\n使用wx:if判断当前页面滚动距离是否达到要求，如果达到所需距离，则渲染这个吸顶的标题栏。\n\n<view class=\"find-hot-header fixed\" wx:if=\"{{scrollTop >= 430}}\">\n   <view class=\"find-hot-title\">最近热门</view>\n</view>\n<view class=\"find-hot-header\">\n    <view class=\"find-hot-title\">最近热门</view>\n</view>\n复制代码7、展开和收起全文\n展示效果\n\n文字部分默认添加class，超出两行文字显示省略号。\n.text-overflow{\n  height: 85rpx;\n  display: -webkit-box;\n  word-break: break-all;\n  text-overflow: ellipsis;\n  overflow: hidden;\n  -webkit-box-orient: vertical;\n  -webkit-line-clamp:2;\n}\n复制代码点击展开全文和收起全文时对showIndex[index]的值取反，对应添加或移除该class。\n<view class=\"find-hot-content {{!showIndex[index] ? 'text-overflow' : ''}}\">\n    {{item.content}}\n</view>\n<view wx:if=\"{{!showIndex[index]}}\" class=\"find-show-all\" data-index=\"{{index}}\" bindtap=\"toggleShow\">展开全文</view>\n<view wx:if=\"{{showIndex[index]}}\" class=\"find-show-all\" data-index=\"{{index}}\" bindtap=\"toggleShow\">收起全文</view>\n复制代码8、更改switch样式\nswitch类名如下，一定要加上父类，不然全局的都会被改掉_(:з」∠)_。\n父类 .wx-switch-input{\n  display: inline-block;\n  position: absolute;\n  top: 20rpx;\n  right: 20rpx;\n  width: 84rpx;\n  height: 44rpx;\n}\n父类 .wx-switch-input::before{\n  width: 80rpx;\n  height: 40rpx;\n}\n父类 .wx-switch-input::after{\n  width: 40rpx;\n  height: 40rpx;\n} \n复制代码四、总结\n通过这次小程序的开发，学到了很多东西，虽然遇到了很多问题，但解决问题的过程让我收获的更多，动手实践才是学习的最好方式。\n另外，此次项目中仍有许多功能不够完善，一些细节还可以继续优化，长路漫漫啊(๑•̀ㅂ•́)و✧。\n如果文章中有错误和不足欢迎批评指正。\n\n项目地址：GitHub\n(づ｡◕‿‿◕｡)づ★ 想要个star"}
{"title": "人民日报海外版点名微信小程序成诈骗温床 “早起签到”、“走路赚钱”等模式乱象仍存 ... ", "author": "Rolan", "pub_time": "2019-7-9 00:06", "content": "7月8日据新华网消息，人民日报海外版此前发文称，近期“早起挑战团”在部分人群中迅速流行，因运营商能够随意更改相关程序的后台数据及规则，用户保证金存风险，小程序成了不法分子“骗完即走”的平台。报道显示，目前以“小程序诈骗”为关键词在网络上搜索目前显示“共有5230000条相关内容”，从“冒牌”公司推销代理业务，到诱导商家签订子虚乌有的合作合同，不法分子利用用户的信息不对称，把微信小程序当成诈骗的“温床”，涉案金额高达数百万。腾讯此前曾回应“早起签到”骗局  目前同类小程序乱象仍存同类事件去年也曾被媒体报道。2018年12月17据央广新闻消息，一款名为“早起签到”的公众号和应用程序“集资”诈骗骗局即采用同类手法侵害用户财产。对于此类现象，腾讯官方曾回应并辟谣表示，对于利用微信公众平台实施涉嫌欺诈、可疑服务或不诚信的行为，或发布任何涉嫌欺诈的信息的账号，一直依照《微信公众平台运营规范》、《微信小程序运营规范》进行打击。同时，微信后台也依据一定标准对文章进行审核评估，截止至12月，微信公众平台已主动发现并删除此类文章 3180篇，封禁及处理帐号813个。财经网测试发现，目前仍有较多同类型小程序和公众号内容存在于微信平台中。在微信小程序中搜索“早起签到”，结果显示大部分小程序仍以“早起签到领现金”、“早起打卡免费旅游”的宣传语吸引用户。 财经网随机进入其中一款签到应用，该平台直接分配了365元“收益”，并提示用户可通过客服体现，联系客服后，对方要求用户关注其公众号，公众号文章及内容虽标明“每天签到撸现金红包，3毛提现秒到账”，但点击文章链接后并无提现渠道，而是诱导用户进入了一款H5小游戏，与最初显示的“签到领现金”毫无关联。此外，在另一款“早起打卡赢现金”的App中还可跳转进入“每天步步赚”小程序，即依靠每日“运动步数”赚现金。 页面注明“首次赚0.3元即可提现，每日提现金额上限20元”，但经财经网反复测试，该提现页面始终显示为“错误：提现失败请重试~”，实际提现操作无法成功。签到、走路均能赚现金？或许没那么简单。除人民日报海外版提及的“集资、诈骗”等问题，同类型小程序目前仍存在虚假宣传、提现承诺无法兑现等问题。此外关于“走路赚钱”经营模式涉嫌违法等质疑近期也频被相关媒体报道微信小程序此前还存在诱导分享、为涉赌小游戏提供渠道等问题小程序生态的繁荣也引来了一批试图打擦边球赚钱的开发者们。除前述“打卡签到”、“走路赚钱”等小程序外，财经网此前也曾报道过微信小程序存在诱导分享、分享页面内容低俗、为涉赌小游戏提供导流渠道等问题。部分游戏小程序进入之后不仅要求强制分享，且分享后会再次出现二维码跳转，此类二维码背后或是棋牌网站链接、或是外部拼购平台等等，此类虚假游戏小程序也亟待平台和识别、清理。北京志霖律师事务所副主任、中国电子商务研究中心研究员赵占领此前也对财经网表示，目前针对这类游戏通过微信群或朋友圈等形式进行推广（的情况），按照互联网信息服务管理办法及网络安全法等法律法规，腾讯有义务采取措施制止赌博、色情等违法信息的传播，具体而言，一般可根据关键词进行屏蔽和处理。值得注意的是，相较其他类型的小程序，17岁及以下人群对小游戏有较高的喜爱程度。统计显示，17岁及其以下的使用小程序类型中，小游戏占比高达74%，处于绝对领先。小程序风口之下，尽管目前国家打击棋牌涉赌游戏力度进一步加大，但上述小游戏及开发人员仍在通过各种手段上线获利，不论是头条、微信、百度还是其他涉足小程序的平台方，加大审查、封禁此类小程序、或二维码导流链接均至关重要。人民日报海外版在其文章中也指出，“微信平台应当承担监管责任，加强对开发者的约束，完善违法犯罪行为的识别系统、举报系统，及时发现不法微信小程序并将其下架，堵塞可能出现的漏洞。其次，立法机构的相关立法和政策要及时跟进，为执法部门和平台及时采取监管措施提供相关依据。再次，监管部门可以建立工作协作平台，进行信息共享，以便提高对非法小程序精准打击的时效和力度。最后，每一个用户应当承担起公共责任，不断提高使用微信小程序的媒介素养，遇到违规违法情形能够敏感意识并及时举报。”"}
{"title": "“套路贷”、“签到诈骗”类微信小程序频出 官方开启专项打击 ... ", "author": "Rolan", "pub_time": "2019-7-18 00:02", "content": "7月17日消息，微信官方账号“微信派”发文表示，微信公众平台近期针对“早起签到打卡诈骗”、“仿冒官方机构”、“套路贷”等三类主要违规行为进行了重点打击。据悉，2018年1月至2019年7月，微信公众平台针对虚假、无资质的信贷类帐号累计处罚了30000多个公众号、2000多个小程序；针对打卡诈骗类帐号累计处罚了公众号826个、小程序253个；针对仿冒官方机构相关帐号，永久封禁公众号76个、小程序46个；同时针对蹭高考热点的663个公众号，174个小程序帐号进行了能力限制、规范帐号名字等处罚。无需下载安装、“用完即走”、开放生态等优势和特点让小程序迅速成为近两年的互联网新风口，据相关数据显示，截至2018年底微信小程序数超过230万、日活用户超2.3亿人次。除微信外，百度、今日头条、阿里等巨头目前也已推出相关业务。另一方面，小程序生态的繁荣也引来了一批试图打擦边球赚钱的开发者们。近期，“套路贷中转站”、“售假”、“签到诈骗”、“虚假宣传”、“过度收集用户信息”等违规微信小程序也被多家媒体集中报道。7月12日据新华视点报道，在微信小程序中搜索“手表”等关键词可发现大量售假小程序，而在部分互联网公司小程序搜索“贷款”关键词，填写相关信息后即会被电话推销“套路贷”相关产品，此外，无序植入广告也成为了虚假宣传的重灾区。除了上述情形外，一种看似更“健康”的小程序类型也成了部分开发者集资诈骗的工具。人民日报海外版近期评论显示，因“早起挑战团”运营商能够随意更改相关程序的后台数据及规则，小程序成了不法分子“骗完即走”的平台，涉案金额可高达数百万。财经网此前对平台中部分“早起签到”、“走路赚钱”类微信小程序进行测试体验发现，微信官方2018年底虽已对上述类型小程序、公众号开展过相应封禁、删除整治工作，事实上平台仍能搜索到部分违规小程序。主要问题包括签到打卡红包无提现渠道、为提现设置障碍、以提现名义向违规公众号、H5小游戏引流等等。除前述涉诈骗、套路贷引流、虚假宣传等微信小程序外，财经网此前也曾报道过微信小程序存在诱导分享、分享页面内容低俗、为涉赌小游戏提供导流渠道等问题。值得注意的是，相较其他类型的小程序，游戏小程序对17岁及以下人群有着更高的吸引力。统计显示，17岁及其以下的使用小程序类型中，小游戏占比高达74%，处于绝对领先。小程序风口之下，尽管目前国家打击棋牌涉赌游戏力度进一步加大，但上述小游戏及开发人员仍在通过各种手段上线获利，不论是头条、微信、阿里、百度还是其他涉足小程序的平台方，加大审查、封禁此类违规小程序、或二维码导流链接均至关重要。自微信小程序上线以来，官方就违规内容已进行多次整治、封禁处理。但相较于平台目前数百万的小程序应用体量以及增长趋势，上述几百或数千的打击力度或无法肃清当下平台乱象，近期众多违规小程序频被报道也说明此前数次官方治理并不能从根源审核上杜绝违规内容。互联网分析人士认为，当下小程序生态仍处于爆发阶段，多巨头入局竞争加剧，打击审查力度过严一定程度上也会遏制自身的快速扩张，能否主观上从源头审核上打击违规是关键。而小程序门槛低、维护简单等特点也让部分开发者试图在生态红利期收割流量、打擦边球，平台方事后监管、再封禁等措施就要跟上，但目前来看力度仍然不够，不应让微信小程序进入“先违规后治理”的怪圈。"}
{"title": "微信推出小程序审核新机制 将提速审核、优化效率 ", "author": "Rolan", "pub_time": "2019-8-5 00:04", "content": "[ 摘要 ]以往，小程序审核更像是“单车道”，同一个第三方、同一时间审核大批量的小程序，也只能一一排队等候通过。8月15日起，平台将上线第三方预检加速机制。同一时间大批量提审的小程序，平台将采取随机抽样的方式进行预先检查。腾讯科技讯 为进一步优化微信小程序第三方审核速率，更公平合理地分配审核资源，8月15日，微信将上线小程序全新审核机制，为第三方服务商的代码提审铺设“快车道”。同时，为保障小程序生态健康发展，微信将构建严厉惩治措施，加大对小程序违规乱象的处理力度。拓宽小程序审核通道 加码提审效率以往，小程序审核更像是“单车道”，同一个第三方、同一时间审核大批量的小程序，也只能一一排队等候通过。8月15日起，平台将上线第三方预检加速机制。同一时间大批量提审的小程序，平台将采取随机抽样的方式进行预先检查。预检质量好的第三方，将会收到审核时长小于12小时的“加速奖励”；反之，预检质量差的第三方则会收到延期3-7天后进行审核的通知。若服务商收到延后审核提醒，也可选择撤回优化，再次提交审核。后续提审质量好的第三方也可更快过审。而对于未抽中预检机制的第三方提审，平台将按提审时间的先后，预计在1-7个工作日内审核完毕。打造“绿色通道” 最快2小时审核第三方服务商旗下的小程序若需紧急上线、或遇突发情况急需调整、可以使用“绿色通道”。9月初开始，平台将为第三方服务商旗下的小程序，提供申请加急审核的接口，审核时长少于12小时，最快2小时完成审核。此外，“加速福利”有额度限制，第三方可以根据实际需求，为小程序进行“提速”。正式的公告消息将在9月发布。此外，为了合理分配审核资源，9月1日开始，第三方提审额度限制（quota）从每周改至每月。通过9月份上线的quota查询接口，开发者就可以对自己的每月quota值一目了然。之后每月一日，平台都将基于第三方的提审质量、线上违规等情况，进行额度限制的自动调整。少违规+高质量，就是加速提审、获取更多福利资源的“核心动力”。构建“反馈+处罚”机制，严肃处理违规现象第三方服务商作为小程序生态的重要一环，平台将逐步建立并完善与第三方的沟通反馈机制，并打通第三方和平台之间的信息壁垒，建立良好的合作共赢关系。同时，第三方也需要明确自身的责任担当，提高改进的意识，为商家提供优质服务，最终实现用户和商业价值的共同放大。对于小程序的违规现象，平台将根据第三方信息进行分析，对于表现不佳及整改效果差的将进行审核降级处理；针对具有多次严重违规行为或对抗平台监管行为的第三方，平台将会将其彻底清理出平台。这次审核调整主要是针对第三方服务商旗下的小程序。通过对审核时效的提升、审核资源的分配等方面进行优化，第三方服务商可以更快地帮助商家上线小程序，更及时地为用户提供优质服务。而对于突发的小程序上线、升级、修复等行为，也可以快速进行调整，为用户提供更好的服务质量，实现小程序更大的商业价值。小程序生态的繁荣离不开第三方服务商、开发者、商家的支持，未来，平台还将继续为普通商户的小程序打造“高速通道”，探索更高效公平的审核机制。"}
{"title": "搭上百度后，知乎小程序该长成什么样？ ", "author": "Rolan", "pub_time": "2019-8-19 00:02", "content": "百度迎来了投资高峰期。 继3000万美元投资有赞后，仅6天后，又传来百度投资知乎的消息。事实上，因为大众对服务商更陌生，知乎的这次动静显然比有赞那次更大。 这次融资是知乎的F轮，本轮融资由快手领投、百度跟投，腾讯和今日资本原有的投资方继续跟投。总额4.34亿美元，这是知乎迄今为止最大的一轮融资，也是近两年来中文互联网化和娱乐领域金额最大的融资之一。知乎CEO周源在宣布融资当天发布的内部信中表示，“新加入的战略股东，将在流量规模和内容生态等方面给予支持。” 无论是流量规模还是内容生态，周源这句话都明显透漏出，知乎要加速商业化进程的意思。 而百度也在其官微信表示，百度战略投资知乎，将进一步加深双方的合作，并以智能小程序作为新一代的内容连接器，为全网用户提供最优质的内容体验。内容商业化不是一个新的话题，但是加入了小程序，知乎的这场内容变现仗究竟会怎么打？1知乎商业化需克服“浅层“到”真层“间的障碍根据知乎官方披露的数据，截至今年 6月，知乎用户数突破 2.5亿，用户日活8000万，人均访问时长2.5小时，月浏览量250亿，累积问答总数超过1.6亿。 而百度APP日活规模达到2亿，移动搜索份额超过80%，15万个小程序入驻百度智能小程序平台，百家号内容创作者超过200万。 这次合作的逻辑大概会是：百度能提供流量入口，并且拥有成熟的商业化广告团队，能弥补知乎的商业化短板，知乎则在内容、百科、社区等一系列问题上补全百度内容生态。据了解，此次合作，知乎全站上亿条问答内容将以智能小程序的形式接入百度App，并在百度搜索、信息流上通过AI技术个性化分发给兴趣不同的用户。 先来看一下知乎的主要产品：2016年，知乎首先推出测试性产品“知乎”，随后原生广告也开始上线；5月，发布知识付费产品“知乎Live”；9月，发布“知乎书店”，连接电子书发售和社区讨论。在知识服务方面，知乎完成了“知乎大学”战略升级。知乎大学由课程、书和训练营三个体系共同组成。课程体系包含Live小讲和私家课，书的体系包含知乎书店的电子书、有声书，及知乎·读书会，以书为基础帮用户构建完整的知识逻辑；训练营则旨在提供轻型培训服务。在内容输出形式上，也形成了图文+音频+视频的矩阵。 这么看来，知乎的产品由知识问答、社区讨论、电子书、课程、训练营。但是从知乎的变现现状来看，广告依然是大头，周源曾透露，2018年上半年知乎商业广告营收额相比去年同期增长340%。 内容和广告的结合，依然是最传统的内容变现方式。说白了，就是换流量的一种方式，是一种“浅层“内容变现，内容知识带来的真正价值并没有被价值化，而精品内容带来的长尾流量和流量产品的多边效益，才是精品内容商业化的最终目的。 事实上，百度并不缺内容，但它投资知乎，看上的就是知乎精品并且成体系的内容，把这些内容匹配进入不同的场景和产品形态。比如，用户百度搜索“上大学”，而知乎本身就具有”上大学“的话题社区，从择校、填志愿、选专业，甚至是哪个专业在哪家公司的就业率最高的相关内容都有，这几个关键点，可以拆分出好几个商业场景，像”择校“就可以是教育咨询机构的商业场景，再通过小程序进行用户沉淀和资源转化，整个环节，用户体验是顺畅的。2知乎小程序该怎么玩？上文提到了知乎小程序的主要产品，知识问答、社区讨论、电子书、课程、训练营。而知乎也表示将在百度上开通小程序，用户可以在百度的产品中，通过这个端口浏览知乎全站内容，还可以在里面进行社交互动。 我们来预估一下，知乎这些产品应该做成什么样的小程序才能达到商业化和知识体系闭环的目的。事实上，各个平台小程序的运营玩法其实互通性很强，微信小程序内不少优秀案例其实是知乎百度智能小程序很好的参考对象。 1.知识问答：互动和拉新如何两不误 首先来看知识问答，这是小程序刚上线时的一种常见形态。当时最著名的当属「头脑王者」，在相当长的一段时间内，其用户深度互动和拉新能力一直在小程序圈津津乐道。 从互动角度看，「头脑王者」最大的杀手锏便是用游戏化玩法“圈”住用户：和单机闯关类答题产品不同，「头脑王者」更强调“对战PK”，用户进入游戏后，会随机匹配在线的用户前来对战，如果要提前结束战斗，还会损失一定金额的金币数，提升对战的仪式感，和互动的乐趣。对战的设定好处颇多：单机闯关更像自娱自乐，而对战不仅互动性乐趣更强，还有天生的拉新优势。「头脑王者」具体是这么做的： 如果用户是新手，需要参加“排位赛”，系统自动匹配在线用户对战，答对或参与都可以获得积分，达到一定积分就拥有邀请朋友对战的资格；转发给朋友，朋友点击进入开始对战，还可以邀请好友观战，对战结束后，还可以把成绩发到两个人都在的群里，进行排位展示。 这种游戏化的思维，知乎可以借鉴。此外，知乎还有个不容忽视的优势，就是优质内容的生成，试想一下，用户不仅可以用系统内的问题进行挑战，还可以自行设计问题进行PK，如A设计问题给B回答，B成功后可以出考题测试A，以此进行更加深度的用户互动。 2．社区讨论：制造更大的KOL 内容社区几乎是内容大拿公司都会觊觎的领域，在这条赛道里，巨头早已涌入，并打出了不错的成绩。腾讯旗下「头牌观点」小程序是一个典型案例，利用互联网职场KOL发表评论来推荐、分发内容。产品设计有两大特色： 在精选文章的下方，会有一位KOL的评论作为该文章的推荐，以便制造影响力阅读。顺应了尤瓦尔·赫拉利在《今日简史》中所说：“在一个信息爆炸却多半无用的世界，清晰的见解就成了一种力量”。“关注”页面，显示用户已经关注的KOL表达的观点；“消息”栏则显示用户翻牌的文章、回复、点赞等信息。“我的”就像一张名片，用户填写完基本职场信息后，就会生成一个主页，显示你点评过的文章。第一种让KOL助推优质内容阅读，第二种让用户主页和和其关注KOL的“绑定”，无疑是加强了用户本身的标签。借此，这个小程序内，呈现出了一个利用微信的社交关系做精英化的趋势。 类似的事情知乎也可以做，并且拥有更好的优势。众所周知，知乎用户多为高知、KOL，具备做精英化内容社群的优势。但知乎的劣势也不容忽视，“知乎大V不够大”是业界的共识，100W粉丝的KOL在知乎里已经算顶级流量，这和微博平台上动辄坐拥千万粉丝量级而言，差距不小。 因此，引导粉丝关注从而制造更多有影响力的KOL是知乎需要补的课。 一个值得注意的点是，社区讨论离不开UCG，而UGC的风险不容小觑。百度投资知乎后，导流是迟早的事，一旦大量流量涌入后，内容生产也将不断加速，若想不踩坑，就需要未雨绸缪早先划下规范和建立监管机制。 3.电子书：异业合作带来场景联动想象力 电子书是知乎一直以来都在着重投入的领域，不同于其他平台的是，知乎是自己来做“出版”业务，其签约的作者则是知乎平台上的知识大V们。 要想在小程序平台把电子书做得“风生水起”，虽然不容易却也不乏突破口，尤其是百度拥有丰富的流量场景与入口。比如百度的搜索场景，用户在搜索某个知识或阅读等关键词的时候，知乎电子书小程序就可以作为搜索结果入口出现。 其中，跨界合作就是一个不错的方式。电子书小程序做得比较成功的微信读书，在两年前就推出过一个联合机场延误险小程序的跨界合作，用户购买机场延误险时，可以进入活动相应入口进入微信读书小程序，可以12小时内免费阅读所有电子书！在百度场景内跨界合作的方式尤其合适，根据用户搜索信息，百度AI可以推算用户可能存在的场景与潜在需求，从而向用户进行推荐相关内容，因此电子书能够实现精准匹配。 4.课程：熟人推荐高于广告投放 利用熟人推荐机制拉新，是知乎的课程业务可以做的事。不少小程序已经采用这个思路实现了很好的拉新和转化，VIPKID就是典型一例。 一方面，VIPKID会用赠课的方式激励老用户朋友圈转发孩子的学习情况，可赠送十节课，由于VIPKID课程较贵，一节课25分钟大约140元，十节课的的增额力度让不少人非常动心，乃至争相转发，这变相帮助VIPKID进行了大量的推广。而由老用户朋友圈介绍而来的新用户，也可以享受一节免费课程，通常免费体验后，客户会跟踪进行电话转化。一般来说，教育类产品，熟人推荐的转化率远远高于广告投放，知乎的课程业务现在还不被太多人知晓，动用种子用户去做圈层推广是一招不错的办法。 5.训练营：用线下活动让人推人 眼下做训练营的企业还真不少，但真正做出声望的还不多，由于训练营生成的内容较为厚重，纯线上的推广方式并非最佳选择。 在我们看来，樊登读书会的模式是一个有意思的样本。从刚开始的几十个微信群，如今发展到470万会员，全国2000家分店，学习社群遍布十几个国家。樊登读书会的社群最大特点线下代理体系。 代理与樊登读书会的关系不一般，多为樊登的粉丝。这些代理商跟樊登的关系不仅仅是合作，还有狂热的情感掺杂其内，因此，在推广的时候，更多是出于真心地将经验和感受分享。 一般而言，分会成立以后，樊登会让其自发运营，摸索出当地的用户特征、办活动要怎么做，而樊登则负责审核每次活动的主题，审核过了，就可以推进。樊登会对分会机构的培训、管理、考核。 之所以非要用线下机构的方式，用樊登的话说就是，“做内容付费，不能靠用户自觉，这样获取信任的成本太高了，应该靠朋友或者他人推荐”。 可见，线下社群活动是训练营的一个方向，因为打造线下体系，就是跟核心用户捆绑在一起，让人去推人，使得获取信任的成本降低。 综合来看，百度与知乎的结合，是成熟的商业化与精品化知识体系的结合。但其面临的挑战，仍是小程序的难题，百度如何能将其流量优势落实在知乎小程序上？知乎要如何打开更多场景？这才是百度与知乎合作的核心命题。"}
